
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабличныеДокументы = ПолучитьСписокТабличныхДокументовНаСервере(ПараметрКоманды);
		
	ИмяФайла = "NonconformityData";
	Расширение = "xlsx";
	ИмяФайлаСРасширением = СтрШаблон("%1.%2", ИмяФайла, Расширение);
	ПолноеИмяФайла = СтрШаблон("%1%2", КаталогВременныхФайлов(), ИмяФайлаСРасширением);
	
	ра_ОбщегоНазначенияКлиентСервер.СохранитьМногостраничныйФайл(ПолноеИмяФайла, ТабличныеДокументы);
	
	ЗапуститьПриложение(ПолноеИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТабличныхДокументовНаСервере(МассивОбъектов)
	
	Возврат ра_ОбщегоНазначения.КнигаExcelПоНесоответствиям(МассивОбъектов);
	
КонецФункции
