
&НаКлиенте
Процедура СписокКлассификаторПриАктивизацииСтроки(Элемент)
	
	ЭлементОтбора = Список.Отбор.Элементы.Получить(0);
	Если ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда
		ЭлементОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
		ЭлементОтбора.Использование  = Истина;
	Иначе
		ЭлементОтбора.Использование  = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = Список.Отбор.Элементы.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("KlassifikatorMTR");
	ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВИерархии;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры
