#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтеграцияBitrix

Процедура СформироватьМассивДанныхGetList(Результат, ПолноеИмя, ПараметрыЗапросаHTTP) Экспорт
	
	ОбъектМетаданных = Метаданные.Справочники.ra_EhtapyVyyavleniyaNesootvetstvij;
	
	ТаблицаРеквизитов = ра_ОбменДанными.ПолучитьТаблицуРеквизитовОбъекта(ОбъектМетаданных);
	
	АктуализироватьТаблицуРеквизитов(ТаблицаРеквизитов);
	
	ТекстЗапросаВложенныеТаблицы = ПолучитьТекстЗапросаВложенныеТаблицы();
	ТекстЗапросаСоединений = ПолучитьТекстЗапросаСоединений();
	
	Запрос = ра_ОбменДанными.ПолучитьЗапрос(ТаблицаРеквизитов, ПараметрыЗапросаHTTP, ПолноеИмя, ТекстЗапросаВложенныеТаблицы, ТекстЗапросаСоединений);
	
	МассивДанных = ра_ОбменДанными.СформироватьМассивДанныхИзЗапроса(Запрос);
	Результат.Вставить("value", МассивДанных);
							
КонецПроцедуры

Процедура АктуализироватьТаблицуРеквизитов(ТаблицаРеквизитов)
		
	
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаВложенныеТаблицы() Экспорт
	
	Возврат "";
			
КонецФункции

Функция ПолучитьТекстЗапросаСоединений() Экспорт
	
	Возврат "";
			
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить(Нстр("ru = 'Наименование'; en = 'NaimenovanieEn'"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.ra_DostupnyeEtapyZhiznennogoCikla КАК ra_DostupnyeEtapyZhiznennogoCikla
	|ГДЕ
	|	ra_DostupnyeEtapyZhiznennogoCikla.Polzovatel = &Polzovatel");
	Запрос.УстановитьПараметр("Polzovatel", ПараметрыСеанса.ТекущийПользователь);
	
	Если Не Параметры.Свойство("НеОтбирать") и Не Запрос.Выполнить().Пустой() Тогда
		
		Запрос = ра_ОбщегоНазначения.ЗапросДанныхВыбораПоТексту(
			СтрШаблон("ВЫБРАТЬ
			|	ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка КАК Ссылка,
			|	ra_EhtapyVyyavleniyaNesootvetstvij.%1 КАК %1,
			|	ra_EhtapyVyyavleniyaNesootvetstvij.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	РегистрСведений.ra_DostupnyeEtapyZhiznennogoCikla КАК ra_DostupnyeEtapyZhiznennogoCikla
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ra_EhtapyVyyavleniyaNesootvetstvij КАК ra_EhtapyVyyavleniyaNesootvetstvij
			|		ПО ra_DostupnyeEtapyZhiznennogoCikla.EhtapVyyavleniyaNesootvetstvij = ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка 
			|			И ra_DostupnyeEtapyZhiznennogoCikla.Polzovatel = &Polzovatel", Нстр("ru = 'Наименование'; en = 'NaimenovanieEn'")),
			Параметры,
			МассивПолей);
			
		Запрос.УстановитьПараметр("Polzovatel", ПараметрыСеанса.ТекущийПользователь);
		
		ра_ОбщегоНазначения.ЗаполнитьДанныеВыбораПоЗапросу(ДанныеВыбора, Параметры, Запрос, МассивПолей, СтрСоединить(МассивПолей, ","));
		
	Иначе
		
		ра_ОбщегоНазначения.ПолучитьСтандартныеДанныеВыбора(Справочники.ra_EhtapyVyyavleniyaNesootvetstvij, ДанныеВыбора, Параметры, СтандартнаяОбработка, МассивПолей, СтрСоединить(МассивПолей, ","));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для каждого КлючИЗнач из Данные Цикл
		Представление = КлючИЗнач.Значение;	
	КонецЦикла;
	
	ра_ОбщегоНазначения.ОбработатьПустоеПредставление(Представление);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТекущийЯзык() = Метаданные.Языки.Английский Тогда
		Поля.Добавить("NaimenovanieEn");	
	Иначе
		Поля.Добавить("Наименование");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
