
Процедура ПриЗаписи(Отказ, Замещение)
	
	// ТСК Талько Э.Г.; 09.06.2018; Управление доступом {
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задачи", ВыгрузитьКолонку("Задача"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЗадачаИсполнителяПредметы.Предмет.Nesootvetstvie, ЗадачаИсполнителяПредметы.Предмет) КАК Несоответствие
	|ИЗ
	|	РегистрСведений.ИсторияСобытийЗадач КАК ИсторияСобытийЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя.Предметы КАК ЗадачаИсполнителяПредметы
	|		ПО ИсторияСобытийЗадач.Задача = ЗадачаИсполнителяПредметы.Ссылка
	|ГДЕ
	|	ИсторияСобытийЗадач.Задача В(&Задачи)
	|	И ЕСТЬNULL(ЗадачаИсполнителяПредметы.Предмет.Nesootvetstvie, ЗадачаИсполнителяПредметы.Предмет) ССЫЛКА Документ.ra_Nesootvetstvie";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ра_ОбщегоНазначения.ПерезаписатьРабочиеГруппыОбъектов(Выборка.Несоответствие, Истина);
	КонецЦикла;
	// ТСК Талько Э.Г.; 09.06.2018; Управление доступом }
	
КонецПроцедуры
