#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
			
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("Nesootvetstvie") Тогда
		Параметры.Отбор.Вставить("Nesootvetstvie", Параметры.Nesootvetstvie);
	КонецЕсли;
	
	МассивПолей = ра_ОбщегоНазначения.ПолучитьПоляВводаПоСтроке(ПустаяСсылка().Метаданные());
		
	Если Не Параметры.Свойство("НеОтбирать") И Параметры.Отбор.Свойство("Nesootvetstvie") Тогда
		
		Несоответствие = Параметры.Отбор.Nesootvetstvie;
						
		Запрос = ра_ОбщегоНазначения.ЗапросДанныхВыбораПоТексту(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВидыПоручений.Ссылка КАК Ссылка,
			|	ВидыПоручений.Представление КАК Наименование,
			|	ВидыПоручений.Код КАК Код,
			|	ВидыПоручений.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.ra_VidyPoruchenij КАК ВидыПоручений
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ra_VidyPoruchenij.VidyPredmetovNesootvetstviya КАК ВидыПредметов
			|		ПО ВидыПоручений.Ссылка = ВидыПредметов.Ссылка
			|ГДЕ
			|	НЕ ЭтоГруппа
			|	И (ВидыПредметов.VidPredmetaNesootvetstviya ЕСТЬ NULL
			|	ИЛИ ВидыПредметов.VidPredmetaNesootvetstviya = &ВидПредмета)",
			Параметры,
			МассивПолей);
				
		Запрос.УстановитьПараметр("ВидПредмета", Несоответствие.VidObektaNesootvetstviya);
		
		ра_ОбщегоНазначения.ЗаполнитьДанныеВыбораПоЗапросу(ДанныеВыбора, Параметры, Запрос, МассивПолей, СтрСоединить(МассивПолей, ","));
				
	Иначе
		
		ра_ОбщегоНазначения.ПолучитьСтандартныеДанныеВыбора(Справочники.ra_VidyPoruchenij, ДанныеВыбора, Параметры, СтандартнаяОбработка, МассивПолей, СтрСоединить(МассивПолей, ","));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Для каждого КлючИЗнач из Данные Цикл
		Представление = КлючИЗнач.Значение;	
	КонецЦикла;
	
	ра_ОбщегоНазначения.ОбработатьПустоеПредставление(Представление);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТекущийЯзык() = Метаданные.Языки.Английский Тогда
		Поля.Добавить("NaimenovanieEn");	
	Иначе
		Поля.Добавить("Наименование");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли