#Область ИнтеграцияBitrix

Функция ЕстьМетодДополнитьОписаниеМетаданных() Экспорт
	
	Возврат Истина;
	
КонецФункции

Процедура ДополнитьОписаниеМетаданных(ОбработкаОбъект, Данные, ПараметрыФормирования) Экспорт
	
	ОбработкаОбъект.ДобавитьИсключения("Ссылка,ПометкаУдаления,Проведен");
	
	ОбработкаОбъект.УстановитьВидимость(
		"Номер,
		|Дата,
		|PrinjatoeReshenie,
		|Kommentarii,
		|Zajavitel,
		|Razrabotchik,
		|Ispolnitel,
		|ObektOSProdukcija,
		|ObektOSTehnicheskajDokumentacija,
		|VidProdukciiVSootvetstviiSGOST,
		|KodOKPD2,
		|KodKKS,
		|KodGID,
		|VidProdukciiVSootvetstviiNP", Истина);	
	
	Если Данные.StatusEhtapa <> Перечисления.ra_StatusyEhtapov.EhtapZavershen Тогда
		
		ОбработкаОбъект.УстановитьДоступность(
			"Номер,
			|Дата,
			|PrinjatoeReshenie,
			|Kommentarii", Истина);
		
	КонецЕсли;
		
	ОбязательныеРеквизиты = ОбработкаОбъект.ОбязательныеРеквизиты();
	АктуализироватьМассивОбязательныхРеквизитов(ОбязательныеРеквизиты, Данные);
	ОбработкаОбъект.УстановитьОбязательность(ОбязательныеРеквизиты, Истина);
	
КонецПроцедуры

Процедура АктуализироватьМассивОбязательныхРеквизитов(МассивРеквизитов, ДокументОбъект) Экспорт
	
КонецПроцедуры

#КонецОбласти
