#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ра_ОбщегоНазначения.ЗаполнитьВидДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	DataRegistracii = НачалоДня(ТекущаяДата());
	Ispolnitel = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ра_Организация");
	
	Если FormaOS = Перечисления.ra_FormyOcenkiSootvetstviya.PoryadokObyazatelnojSertifikacii Тогда 
		VidProdukciiVSootvetstviiSNP_071_18 = Перечисления.ra_VidyProdukciiVSootvetstviiSNP_071_18.K;
	КонецЕсли;
	
	Если FormaOS = Перечисления.ra_FormyOcenkiSootvetstviya.Priemka Тогда
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ispolnitel, "ра_СпециализированнаяОрганизация,ра_ЭксплуатирующаяОрганизация");
		Если НЕ СтруктураРеквизитов["ра_СпециализированнаяОрганизация"]
				И НЕ СтруктураРеквизитов["ра_ЭксплуатирующаяОрганизация"]
				И Ссылка.Пустая() Тогда
			ВызватьИсключение НСтр("ru = 'Автор не числится в эксплуатирующей или в специализированной организации'; en = 'User is not associated to operating or specialized organization'");
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Документы.ra_ZayavkaNaOcenkuSootvetstviya2.АктуализироватьМассивОбязательныхРеквизитов(ПроверяемыеРеквизиты, ЭтотОбъект);
	
	Если DataZayavki > DataRegistracii И (ЗначениеЗаполнено(DataZayavki) И ЗначениеЗаполнено(DataRegistracii)) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата регистрации не может быть раньше даты заявки'; en = 'Registration date must be later than the application date'"), , "DataZayavki", , Отказ)
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373{
	//Если ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности() Тогда
	//	ВремяНачала = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	//	ДополнительныеСвойства.Вставить("ВремяНачала", ВремяНачала);	
	//КонецЕсли;
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373}
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ра_ОбщегоНазначения.ДокументыКачестваПередЗаписью(ЭтотОбъект);
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ДополнительныеСвойства.Свойство("НужноПометитьНаУдалениеБизнесСобытия") Тогда
	//	БизнесСобытияВызовСервера.ПометитьНаУдалениеСобытияПоИсточнику(Ссылка);
	//КонецЕсли;
	//
	//// ТСК Корнюшенков А.Ю. 28.06.2018 {
	//// настройка автозапуска процессов для документа "Уведомление о несоответствии"
	//// Возможно, выполнена явная регистрация событий при загрузке объекта.
	//Если Не ДополнительныеСвойства.Свойство("НеРегистрироватьБизнесСобытия") Тогда
	//	Если ДополнительныеСвойства.ЭтоНовый Тогда
	//		БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(Ссылка, Справочники.ВидыБизнесСобытий.СозданиеВнутреннегоДокумента);
	//	Иначе
	//		Если НЕ ра_ОбщегоНазначения.ЕстьБизнесПроцессыПоДокументу(Ссылка) Тогда
	//			БизнесСобытияВызовСервера.ЗарегистрироватьСобытие(Ссылка, Справочники.ВидыБизнесСобытий.ИзменениеВнутреннегоДокумента);
	//			ДополнительныеСвойства.Вставить("СтартВыполнен", Истина);
	//			ДополнительныеСвойства.Вставить("Описание", "ok");
	//		Иначе
	//			ДополнительныеСвойства.Вставить("СтартВыполнен", Ложь);
	//			ДополнительныеСвойства.Вставить("Описание", НСтр("ru = 'Не запущен процесс согласования измененного уведомления, т.к. есть предыдущие незавершенные бизнес-процесы.'; en = 'The start of the business process is canceled. There are unfinished business processes.'"));
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//// ТСК Корнюшенков А.Ю. 28.06.2018 }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьУчастниковРабочейГруппыВНабор(ТаблицаНабора) Экспорт
	
	Организации = Новый Массив;
	Организации.Добавить(EkspluatiruyushchayaOrganizaciya);
	Организации.Добавить(Ispolnitel);
	Организации.Добавить(Izgotovitel);
	Организации.Добавить(Zayavitel);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ра_Организация В(&Организации)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаНабора, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
