
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		Объект.ДокументОснование  = Параметры.ДокументОснование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)

	Записать();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКомиссию(Команда)
	
	ЗаполнитьКомиссиюНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКомиссиюНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ra_NaznachenieKomissiiEksperty.FIO КАК FIO,
	               |	ra_NaznachenieKomissiiEksperty.Organizaciya КАК Organizaciya,
	               |	ra_NaznachenieKomissiiEksperty.RolSpetsialista КАК RolSpetsialista,
	               |	ra_NaznachenieKomissiiEksperty.NomerAttestata КАК NomerAttestata
	               |ИЗ
	               |	Документ.ra_NaznachenieKomissii.Eksperty КАК ra_NaznachenieKomissiiEksperty
	               |ГДЕ
	               |	ra_NaznachenieKomissiiEksperty.Ссылка.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	
	ТЗ_Эксперты = Запрос.Выполнить().Выгрузить();
	Объект.Eksperty.Загрузить(ТЗ_Эксперты);
	
КонецПроцедуры

#КонецОбласти
