#Область ПрограммныйИнтерфейс

// Вызывается при первом запуске. Служит для первоначального наполнения информационной базы.
//
Процедура ПервыйЗапуск() Экспорт
	
	// Отключим нелокализованные инструкции.
	Если ТекущийЯзык() <> Метаданные.Языки.Русский Тогда
		Константы.ИспользоватьИнструкции.Установить(Ложь);
	КонецЕсли;
	
	// Справочники.АдреснаяКнига - заполняется в модуле менеджера.
	
	// Справочники.Виджеты.

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.Мероприятия,
		"Наименование",
		НСтр("ru = 'Мероприятия'; en = 'Events'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.МоиДокументы,
		"Наименование",
		НСтр("ru = 'Мои документы'; en = 'My documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.Почта,
		"Наименование",
		НСтр("ru = 'Почта'; en = 'Email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.Форум,
		"Наименование",
		НСтр("ru = 'Форум'; en = 'Forum'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.Календарь,
		"Наименование",
		НСтр("ru = 'Календарь'; en = 'Calendar'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.МоиЗадачи,
		"Наименование",
		НСтр("ru = 'Мои задачи'; en = 'My tasks'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.Контроль,
		"Наименование",
		НСтр("ru = 'Контроль'; en = 'Monitoring'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.ЕжедневныеОтчеты,
		"Наименование",
		НСтр("ru = 'Ежедневные отчеты'; en = 'Daily reports'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.СВД,
		"Наименование",
		НСтр("ru = 'СВД'; en = 'EDES'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.МоиДела,
		"Наименование",
		НСтр("ru = 'Мои дела'; en = 'Current tasks'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.МоиФайлы,
		"Наименование",
		НСтр("ru = 'Я редактирую'; en = 'Edited by me'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.МоиПроекты,
		"Наименование",
		НСтр("ru = 'Мои проекты'; en = 'My projects'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Виджеты.ЗадачиОтдела,
		"Наименование",
		НСтр("ru = 'Задачи отдела'; en = 'Tasks of department'"));

	// Справочники.ВидыБизнесСобытий - заполняется в модуле ОбновлениеИнформационнойБазыДокументооборот.
	
	ОбновитьПредопределенныйЭлемент(Справочники.ВидыБизнесСобытий.ПолучениеВходящегоПисьма,
		"Наименование",
		НСтр("ru='Получение входящего письма'; en = 'Receiving incoming mail'"));
	
	// Справочники.ВидыДокументовФизическихЛиц.

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ,
		"Наименование",
		НСтр("ru = 'Загранпаспорт гражданина РФ'; en = 'Russian international passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса,
		"Наименование",
		НСтр("ru = 'Военный билет офицера запаса'; en = 'Reserve officer military ID'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет,
		"Наименование",
		НСтр("ru = 'Военный билет'; en = 'Military ID'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт,
		"Наименование",
		НСтр("ru = 'Дипломатический паспорт гражданина РФ'; en = 'Russian diplomatic passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР,
		"Наименование",
		НСтр("ru = 'Паспорт гражданина СССР'; en = 'Soviet Union passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение,
		"Наименование",
		НСтр("ru = 'Водительское удостоверение'; en = 'Driver license'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера,
		"Наименование",
		НСтр("ru = 'Удостоверение личности офицера'; en = 'Officer military ID'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР,
		"Наименование",
		НСтр("ru = 'Загранпаспорт гражданина СССР'; en = 'Soviet Union international passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка,
		"Наименование",
		НСтр("ru = 'Паспорт моряка'; en = 'Sailor''s passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ,
		"Наименование",
		НСтр("ru = 'Паспорт гражданина РФ'; en = 'Russian internal passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота,
		"Наименование",
		НСтр("ru = 'Паспорт Минморфлота'; en = 'Minmorflot passport'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении,
		"Наименование",
		НСтр("ru = 'Свидетельство о рождении'; en = 'Birth certificate'"));

	// Справочники.ВидыКонтактнойИнформации.

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ДомашнийТелефонФизическогоЛица,
		"Наименование",
		НСтр("ru = 'Домашний телефон'; en = 'Home phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникПользователи,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Пользователи""'; en = 'Contact information for catalog ""Users""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента,
		"Наименование",
		НСтр("ru = 'Факс'; en = 'Fax'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента,
		"Наименование",
		НСтр("ru = 'Фактический адрес'; en = 'Actual address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
		"Наименование",
		НСтр("ru = 'Юридический адрес'; en = 'Legal address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица,
		"Наименование",
		НСтр("ru = 'Мобильный телефон'; en = 'Mobile phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации,
		"Наименование",
		НСтр("ru = 'Фактический адрес'; en = 'Actual address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента,
		"Наименование",
		НСтр("ru = 'Почтовый адрес'; en = 'Postal address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,
		"Наименование",
		НСтр("ru = 'Телефон'; en = 'Phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента,
		"Наименование",
		НСтр("ru = 'Юридический адрес'; en = 'Legal address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Контактные лица""'; en = 'Contact information for catalog ""Contact persons""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Физические лица""'; en = 'Contact information for catalog ""Individuals""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации,
		"Наименование",
		НСтр("ru = 'Почтовый адрес'; en = 'Postal address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица,
		"Наименование",
		НСтр("ru = 'Мобильный телефон'; en = 'Mobile phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникЛичныеАдресаты,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Личные адресаты""'; en = 'Contact information for catalog ""Personal contacts""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникОрганизации,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Организации""'; en = 'Contact information for catalog ""Companies""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ФаксАдресата,
		"Наименование",
		НСтр("ru = 'Факс'; en = 'Fax'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,
		"Наименование",
		НСтр("ru = 'Телефон'; en = 'Phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Контрагенты""'; en = 'Contact information for catalog ""Counterparties""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СайтКонтрагента,
		"Наименование",
		НСтр("ru = 'Сайт'; en = 'Website'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресАдресата,
		"Наименование",
		НСтр("ru = 'Почтовый адрес'; en = 'Postal address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,
		"Наименование",
		НСтр("ru = 'Факс'; en = 'Fax'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.УдалитьДругаяИнформацияОрганизации,
		"Наименование",
		НСтр("ru = 'Другое'; en = 'Other'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.РабочийТелефонАдресата,
		"Наименование",
		НСтр("ru = 'Рабочий телефон'; en = 'Work phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникРолиИсполнителей,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Роли исполнителей""'; en = 'Contact information for catalog ""Performer roles""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя,
		"Наименование",
		НСтр("ru = 'Телефон'; en = 'Phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица,
		"Наименование",
		НСтр("ru = 'Рабочий телефон'; en = 'Work phone'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица,
		"Наименование",
		НСтр("ru = 'Домашний адрес'; en = 'Home address'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации,
		"Наименование",
		НСтр("ru = 'Другое'; en = 'Other'"));

	// Справочники.ВидыСостоянийДокументовВСВД.

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыСостоянийДокументовВСВД.ЗарегистрированПолучателем,
		"Наименование",
		НСтр("ru = 'Зарегистрирован'; en = 'Registered'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыСостоянийДокументовВСВД.ДоставленКонтрагенту,
		"Наименование",
		НСтр("ru = 'Доставлен'; en = 'Delivered'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыСостоянийДокументовВСВД.ВОчередиНаОтправку,
		"Наименование",
		НСтр("ru = 'В очереди'; en = 'In queue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыСостоянийДокументовВСВД.Ошибка,
		"Наименование",
		НСтр("ru = 'Ошибка'; en = 'Error'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыСостоянийДокументовВСВД.Отправлен,
		"Наименование",
		НСтр("ru = 'Отправлен'; en = 'Sent'"));

	// Справочники.ГруппыВнешнихПользователей.

	ОбновитьПредопределенныйЭлемент(Справочники.ГруппыВнешнихПользователей.ВсеВнешниеПользователи,
		"Наименование",
		НСтр("ru = 'Все внешние пользователи'; en = 'All external users'"));

	// Справочники.ГруппыДоступа.

	ОбновитьПредопределенныйЭлемент(Справочники.ГруппыДоступа.Администраторы,
		"Наименование",
		НСтр("ru = 'Администраторы'; en = 'Administrators'"));

	// Справочники.ГруппыКонтрольныхТочек.

	ОбновитьПредопределенныйЭлемент(Справочники.ГруппыКонтрольныхТочек.Все,
		"Наименование",
		НСтр("ru = 'Все'; en = 'All'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ГруппыКонтрольныхТочек.НеВГруппе,
		"Наименование",
		НСтр("ru = 'Не в группе'; en = 'Not in group'"));

	// Справочники.РабочиеГруппы.

	ОбновитьПредопределенныйЭлемент(Справочники.РабочиеГруппы.ВсеПользователи,
		"Наименование",
		НСтр("ru = 'Все пользователи'; en = 'All users'"));
		
	Справочники.АдреснаяКнига.ОбновитьДанныеОбъекта(
			Справочники.РабочиеГруппы.ВсеПользователи,
			Справочники.РабочиеГруппы.ПустаяСсылка(),
			Справочники.АдреснаяКнига.ПоРабочимГруппам);

	// Справочники.КатегорииДанных.

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииДанных.ВсеКатегории,
		"Наименование",
		НСтр("ru = 'Все категории'; en = 'All categories'"));

	// Справочники.КатегорииОтчетов.

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.Статистические,
		"Наименование",
		НСтр("ru = 'Статистические'; en = 'Statistical'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоВнутреннимДокументам,
		"Наименование",
		НСтр("ru = 'Внутренние документы'; en = 'Internal documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.Администрирование,
		"Наименование",
		НСтр("ru = 'Администрирование'; en = 'Administration'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоЗадачамИПроцессам,
		"Наименование",
		НСтр("ru = 'По задачам и процессам'; en = 'On tasks and processes'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоМероприятиям,
		"Наименование",
		НСтр("ru = 'По мероприятиям'; en = 'On events'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоДокументам,
		"Наименование",
		НСтр("ru = 'По всем документам'; en = 'On all documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПерсональныеДанные,
		"Наименование",
		НСтр("ru = 'Персональные данные'; en = 'Personal data'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоИсполнителям,
		"Наименование",
		НСтр("ru = 'По исполнителям'; en = 'On performers'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.Просроченное,
		"Наименование",
		НСтр("ru = 'О просрочке'; en = 'On delays'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоИсходящимДокументам,
		"Наименование",
		НСтр("ru = 'Исходящие документы'; en = 'Outgoing documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоВходящимДокументам,
		"Наименование",
		НСтр("ru = 'Входящие документы'; en = 'Incoming documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоКонтрагентам,
		"Наименование",
		НСтр("ru = 'По контрагентам'; en = 'On counterparties'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоОбращениямГраждан,
		"Наименование",
		НСтр("ru = 'Обращения граждан'; en = 'On citizen appeals'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоДоговорам,
		"Наименование",
		НСтр("ru = 'По договорам'; en = 'On contracts'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПоПроектам,
		"Наименование",
		НСтр("ru = 'По проектам'; en = 'On projects'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ПланФакт,
		"Наименование",
		НСтр("ru = 'План-факт'; en = 'Planned vs actual'"));

	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.КонтрольныеОтчеты,
		"Наименование",
		НСтр("ru = 'Контрольные'; en = 'Monitoring'"));

	// Справочники.Метрики.

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.Контрагенты,
		"Наименование",
		НСтр("ru = 'Количество контрагентов'; en = 'Number of counterparties'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.РазмерФайлов,
		"Наименование",
		НСтр("ru = 'Размер файлов (Мб)'; en = 'File size (MB)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.ОперативнаяОчередь,
		"Наименование",
		НСтр("ru = 'Оперативная очередь'; en = 'Rapid queue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.АктивныеПользователи,
		"Наименование",
		НСтр("ru = 'Активные пользователи'; en = 'Active users'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.НевыполненныеЗадачи,
		"Наименование",
		НСтр("ru = 'Невыполненные задачи'; en = 'Unexecuted tasks'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.АктивностьПользователей,
		"Наименование",
		НСтр("ru = 'Активность пользователей'; en = 'User activity'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.ДолгаяОчередь,
		"Наименование",
		НСтр("ru = 'Долгая очередь'; en = 'Slow queue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.Файлы,
		"Наименование",
		НСтр("ru = 'Количество файлов'; en = 'Number of files'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Метрики.АктивныеПроцессы,
		"Наименование",
		НСтр("ru = 'Активные процессы'; en = 'Active processes'"));

	// Справочники.НаборыДополнительныхРеквизитовИСведений.

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Согласование_Согласовать,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи согласующего'; en = 'Add. properties of approver''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Приглашение_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Приглашение""'; en = 'Add. properties of process Invitation'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтрагентыФизЛицо,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Контрагенты"" (физлицо)'; en = 'Add. properties of catalog ""Counterparties"" (individual)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Исполнение_Контролировать,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи контролёра'; en = 'Add. properties of monitor''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтрагентыИП,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Контрагенты"" (индивидуальный предприниматель)';en = 'Add. properties of catalog ""Counterparties"" (Individual entrepreneur)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтрагентыНерезидент,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Контрагенты"" (нерезидент)'; en = 'Add. properties of catalog ""Counterparties"" (outside of Russia)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ВходящиеДокументы_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Входящие документы"" (общие)'; en = 'Add. properties of catalog ""Incoming documents"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_КонтрагентыЮрЛицо,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Контрагенты"" (юрлицо)'; en = 'Add. properties of catalog ""Counterparties"" (legal entity)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_РешениеВопросовВыполненияЗадач_ОзнакомлениеСРезультатомРассмотрения,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи автора вопроса'; en = 'Add. properties of issue author''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Исполнение_ОтветственноеИсполнение,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ответственного исполнителя'; en = 'Add. properties of responsible performer''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Поручение_Контролировать,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи контролёра'; en = 'Add. properties of responsible monitor''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Приглашение_Пригласить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи Пригласить'; en = 'Add. properties of task Invite'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ВнутренниеДокументы_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Внутренние документы"" (общие)'; en = 'Add. properties of catalog ""Internal documents"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Согласование_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Ознакомиться с результатами согласования""'; en = 'Add. properties of task ""Examine the approval results""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_БанковскиеСчетаОрганизации,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Банковские счета"" (организации)'; en = 'Add. properties of catalog ""Bank accounts"" (legal entities)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_КомплексныйПроцесс_Контролер,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи контролёра в комплексном процессе'; en = 'Add. properties of monitor''s task in composite process'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Контрагенты"" (общие)'; en = 'Add. properties of catalog ""Counterparties"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_РешениеВопросовВыполненияЗадач_РассмотрениеИнициатором,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи автора процесса'; en = 'Add. properties of process author''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Согласование_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Согласование""'; en = 'Add. properties of process ""Approval""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ИсходящиеДокументы_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Исходящие документы"" (общие)'; en = 'Add. properties of catalog ""Outgoing documents"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Исполнение_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Исполнение""'; en = 'Add. properties of process ""Performance""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Рассмотрение_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Рассмотрение""'; en = 'Add. properties of process ""Reviewal""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Поручение_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Поручение""'; en = 'Add. properties of process ""Order""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Поручение_Проверить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи проверяющего'; en = 'Add. properties of verifier''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Приглашение_Оповестить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи Оповестить'; en = 'Add. properties of task Notify'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Регистрация_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Регистрация""'; en = 'Add. properties of process ""Registration""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Исполнение_Проверить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи проверяющего'; en = 'Add. properties of verifier''s task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_БанковскиеСчета_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Банковские счета"" (общие)'; en = 'Add. properties of catalog ""Bank accounts"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Утверждение_Утвердить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Утвердить""'; en = 'Add. properties of task ""Confirm""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Проекты_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Проекты"" (общие)'; en = 'Add. properties of catalog ""Projects"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Рассмотрение_Рассмотреть,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Рассмотреть""'; en = 'Add. properties of task ""Review""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Ознакомление_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи исполнителя'; en = 'Add. properties of performer task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Регистрация_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Ознакомиться с регистрацией""'; en = 'Add. properties of task ""Examine the registration""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Утверждение_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Утверждение""'; en = 'Add. properties of process ""Confirmation""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ПроектныеЗадачи_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Проектные задачи"" (общие)'; en = 'Add. properties of catalog ""Project tasks"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_РешениеВопросовВыполненияЗадач_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Решение вопросов выполнения задач""'; en = 'Add. properties of process ""Task execution issue solving""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Поручение_Выполнить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи исполнителя'; en = 'Add. properties of performer task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Ознакомление_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства процесса ""Ознакомление""'; en = 'Add. properties of process ""Examination""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Регистрация_Зарегистрировать,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Зарегистрировать""'; en = 'Add. properties of task ""Register""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_БанковскиеСчетаКонтрагента,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Банковские счета"" (контрагента)'; en = 'Add. properties of catalog ""Bank account"" (counterparties)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Мероприятия_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Мероприятия"" (общие)'; en = 'Add. properties of catalog ""Events"" (common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Исполнение_Исполнить,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи исполнителя'; en = 'Add. properties of performer task'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_КомплексныйПроцесс_Общие,
		"Наименование",
		НСтр("ru = 'Доп. свойства комплексного процесса (Общие)'; en = 'Add. properties of composite process (Common)'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Приглашение_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи Ознакомиться'; en = 'Add. properties of task Examine'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Утверждение_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Ознакомиться с результатом утверждения""'; en = 'Add. properties of task ""Examine the confirmation result""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.БизнесПроцесс_Рассмотрение_Ознакомиться,
		"Наименование",
		НСтр("ru = 'Доп. свойства задачи ""Ознакомиться""'; en = 'Add. properties of task ""Examine""'"));

	// Справочники.НаименованияСторон.

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Заказчик,
		"Наименование",
		НСтр("ru = 'Заказчик'; en = 'Customer'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Исполнитель,
		"Наименование",
		НСтр("ru = 'Исполнитель'; en = 'Contractor'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Покупатель,
		"Наименование",
		НСтр("ru = 'Покупатель'; en = 'Buyer'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Продавец,
		"Наименование",
		НСтр("ru = 'Продавец'; en = 'Seller'"));

	// Справочники.Нумераторы.

	ОбновитьПредопределенныйЭлемент(Справочники.Нумераторы.ИсходящиеДокументы,
		"Наименование",
		НСтр("ru = 'Исходящие документы'; en = 'Outgoing documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Нумераторы.ВходящиеДокументы,
		"Наименование",
		НСтр("ru = 'Входящие документы'; en = 'Incoming documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Нумераторы.ВнутренниеДокументы,
		"Наименование",
		НСтр("ru = 'Внутренние документы'; en = 'Internal documents'"));

	ОбновитьПредопределенныйЭлемент(Справочники.Нумераторы.Штрихкоды,
		"Наименование",
		НСтр("ru = 'Штрихкоды'; en = 'Barcodes'"));

	// Справочники.ОбластиДелегированияПрав.

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Мероприятия,
		"Наименование",
		НСтр("ru = 'Мероприятия'; en = 'Events'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Почта,
		"Наименование",
		НСтр("ru = 'Почта'; en = 'Email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Календарь,
		"Наименование",
		НСтр("ru = 'Календарь'; en = 'Calendar'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.ПроцессыИЗадачи,
		"Наименование",
		НСтр("ru = 'Процессы и задачи'; en = 'Processes and tasks'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Обсуждения,
		"Наименование",
		НСтр("ru = 'Обсуждения'; en = 'Forum'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.ЕжедневныеОтчеты,
		"Наименование",
		НСтр("ru = 'Ежедневные отчеты'; en = 'Daily reports'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.ДокументыИФайлы,
		"Наименование",
		НСтр("ru = 'Документы и файлы'; en = 'Documents and files'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Контроль,
		"Наименование",
		НСтр("ru = 'Контроль'; en = 'Monitoring'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ОбластиДелегированияПрав.Проекты,
		"Наименование",
		НСтр("ru = 'Проекты'; en = 'Projects'"));

	// Справочники.ПапкиФайлов.

	ОбновитьПредопределенныйЭлемент(Справочники.ПапкиФайлов.Шаблоны,
		"Наименование",
		НСтр("ru = 'Шаблоны файлов'; en = 'File templates'"));

	// Справочники.ПапкиФорума.

	ОбновитьПредопределенныйЭлемент(Справочники.ПапкиФорума.ТемыДокументов,
		"Наименование",
		НСтр("ru = 'Предметные темы'; en = 'Subject threads'"));

	// Справочники.ПоказателиВиджетов.

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.СВД_ГотовыеКОтправке,
		"Наименование",
		НСтр("ru = 'К отправке'; en = 'Ready to send'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Контроль_Просрочено,
		"Наименование",
		НСтр("ru = 'Просрочено'; en = 'Overdue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Мероприятия,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.СВД_СОшибкой,
		"Наименование",
		НСтр("ru = 'С ошибкой'; en = 'With errors'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиЗадачи_НеПринятые,
		"Наименование",
		НСтр("ru = 'Не принято'; en = 'Not accepted'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиЗадачи,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиДокументы_ВходящиеБезОтвета,
		"Наименование",
		НСтр("ru = 'Без ответа'; en = 'Unanswered'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.ЗадачиОтдела_Просроченные,
		"Наименование",
		НСтр("ru = 'Просрочено'; en = 'Overdue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиДокументы_Просроченные,
		"Наименование",
		НСтр("ru = 'Просрочено'; en = 'Overdue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Почта,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.ЗадачиОтдела,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиДокументы_ВнутренниеСИстекающимСрокомДействия_Исполнения,
		"Наименование",
		НСтр("ru = 'Истекают'; en = 'Expiring'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Контроль,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Форум_НовыеОтветыНаСообщенияПользователя,
		"Наименование",
		НСтр("ru = 'Новые ответы на сообщения пользователя'; en = 'New replies to user messages'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Почта_УчетнаяЗапись,
		"Наименование",
		НСтр("ru = 'Учетная запись'; en = 'Account'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиЗадачи_Просроченные,
		"Наименование",
		НСтр("ru = 'Просрочено'; en = 'Overdue'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиФайлы_РедактируемыеФайлы,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Календарь,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.ЗадачиОтдела_НеПринятые,
		"Наименование",
		НСтр("ru = 'Не принято'; en = 'Not accepted'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.Форум,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.МоиДокументы,
		"Наименование",
		НСтр("ru = 'Общее количество'; en = 'Total number'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ПоказателиВиджетов.СВД_ЗагруженныеНаПроверку,
		"Наименование",
		НСтр("ru = 'На проверку'; en = 'To verify'"));

	// Справочники.РассылкиОтчетов.

	ОбновитьПредопределенныйЭлемент(Справочники.РассылкиОтчетов.ЛичныеРассылки,
		"Наименование",
		НСтр("ru = 'Личные рассылки'; en = 'Personal mailing lists'"));

	// Справочники.СпособыДоставки.

	ОбновитьПредопределенныйЭлемент(Справочники.СпособыДоставки.СВД,
		"Наименование",
		НСтр("ru = 'СВД'; en = 'EDES'"));

	// Справочники.СправочникДляОткрытияСпискаПисем.

	ОбновитьПредопределенныйЭлемент(Справочники.СправочникДляОткрытияСпискаПисем.Умолчательный,
		"Наименование",
		НСтр("ru = 'Умолчательный'; en = 'Default'"));

	// Справочники.СтраныМира.

	ОбновитьПредопределенныйЭлемент(Справочники.СтраныМира.Россия,
		"Наименование",
		НСтр("ru = 'РОССИЯ'; en = 'RUSSIA'"));

	// Справочники.ТипыСвязей.

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправленОтветныйДокумент,
		"Наименование",
		НСтр("ru = 'Отправлен ответный документ'; en = 'Sent reply document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученОтветныйДокумент,
		"Наименование",
		НСтр("ru = 'Получен ответный документ'; en = 'Received reply document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученОтвет,
		"Наименование",
		НСтр("ru = 'Получен ответ'; en = 'Received reply'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПервичноеОбращение,
		"Наименование",
		НСтр("ru = 'Является повторным для'; en = 'Is repeat one for'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПисьмоОснование,
		"Наименование",
		НСтр("ru = 'Письмо-основание'; en = 'Original email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПисьмоОтправленоВОтветНа,
		"Наименование",
		НСтр("ru = 'Письмо отправлено в ответ на'; en = 'Email sent in reply to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправилоДокумент,
		"Наименование",
		НСтр("ru = 'Отправило документ'; en = 'Sent document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ДелаетНеДействующим,
		"Наименование",
		НСтр("ru = 'Делает недействующим'; en = 'Voids'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.Содержит,
		"Наименование",
		НСтр("ru = 'Содержит'; en = 'Contains'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправленоОтветноеПисьмо,
		"Наименование",
		НСтр("ru = 'Отправлено ответное письмо'; en = 'Sent reply email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправленВОтветНа,
		"Наименование",
		НСтр("ru = 'Отправлен в ответ на'; en = 'Sent in reply to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ВходитВКомплект,
		"Наименование",
		НСтр("ru = 'Входит в комплект'; en = 'Belongs to set'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПовторноеОбращение,
		"Наименование",
		НСтр("ru = 'Является первичным для'; en = 'Is primary for'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтветПереадресовавшему,
		"Наименование",
		НСтр("ru = 'Отправлен ответ переадресовавшему'; en = 'Sent reply to forwarded'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПереадресованДокументом,
		"Наименование",
		НСтр("ru = 'Переадресован документом'; en = 'Forwarded by document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.НеДействуетВСоответствии,
		"Наименование",
		НСтр("ru = 'Не действует в соответствии'; en = 'Void according to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученВОтветНаПисьмо,
		"Наименование",
		НСтр("ru = 'Получен в ответ на письмо'; en = 'Received in reply to email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПереадресацияДокумента,
		"Наименование",
		НСтр("ru = 'Переадресация документа'; en = 'Document forwarding'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОсновноеОбращение,
		"Наименование",
		НСтр("ru = 'Является дубликатом для'; en = 'Is duplicate for'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.НаОснованииПисьма,
		"Наименование",
		НСтр("ru = 'На основании письма'; en = 'Based on email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.Дубликат,
		"Наименование",
		НСтр("ru = 'Является основным для'; en = 'Is main for'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.СоздалоДокумент,
		"Наименование",
		НСтр("ru = 'Создало документ'; en = 'Created document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ВОтветНаПереадресованное,
		"Наименование",
		НСтр("ru = 'Отправлен в ответ на переадресованное'; en = 'Sent in reply to forwarded'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПерепискаПоПредмету,
		"Наименование",
		НСтр("ru = 'Переписка по предмету'; en = 'Correspondence by subject'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПересылкаПисьма,
		"Наименование",
		НСтр("ru = 'Пересылка письма'; en = 'Email forwarding'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученВОтветНа,
		"Наименование",
		НСтр("ru = 'Получен в ответ на'; en = 'Received in reply to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправленОтвет,
		"Наименование",
		НСтр("ru = 'Отправлен ответ'; en = 'Sent reply'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученоВОтветНаПисьмо,
		"Наименование",
		НСтр("ru = 'Получено в ответ на письмо'; en = 'Received in reply to email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученоОтветноеПисьмо,
		"Наименование",
		НСтр("ru = 'Получено ответное письмо'; en = 'Received reply email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПересланоПисьмом,
		"Наименование",
		НСтр("ru = 'Переслано письмом'; en = 'Forwarded by email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ОтправленВОтветНаПисьмо,
		"Наименование",
		НСтр("ru = 'Отправлен в ответ на письмо'; en = 'Sent in reply to email'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПолученоВОтветНаДокумент,
		"Наименование",
		НСтр("ru = 'Получено в ответ на документ'; en = 'Received in reply to document'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПредметПереписки,
		"Наименование",
		НСтр("ru = 'Содержит переписку по'; en = 'Contains correspondence on'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.СодержитСсылкуНаИнтегрированныйОбъект,
		"Наименование",
		НСтр("ru = 'Содержит ссылку на'; en = 'Contains reference to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправлениеПисьма,
		"Наименование",
		НСтр("ru = 'Перенаправление письма'; en = 'Email forwarding'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправленоПисьмом,
		"Наименование",
		НСтр("ru = 'Перенаправлено письмом'; en = 'Forwarded by email'"));

	// Справочники.УровниДоступа.

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Регистрация,
		"Наименование",
		НСтр("ru = 'Регистрация'; en = 'Register'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Редактирование,
		"Наименование",
		НСтр("ru = 'Редактирование'; en = 'Change'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Чтение,
		"Наименование",
		НСтр("ru = 'Чтение'; en = 'Read'"));

	// Справочники.УчетныеЗаписиЭлектроннойПочты.

	ОбновитьПредопределенныйЭлемент(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
		"Наименование",
		НСтр("ru = 'Системная учетная запись'; en = 'System account'"));

	// Справочники.ФорматыСообщенийСВД.

	ОбновитьПредопределенныйЭлемент(Справочники.ФорматыСообщенийСВД.Сообщение1СДокументооборот,
		"Наименование",
		НСтр("ru = 'Сообщение 1С:Документооборот'; en = '1C:Document Management message'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ФорматыСообщенийСВД.ОператорЭДО1СТакском,
		"Наименование",
		НСтр("ru = 'Через оператора ЭДО 1С-Такском'; en = 'Via EDI operator 1C-Taxcom'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ФорматыСообщенийСВД.СообщениеПоГОСТ53898ВложенныеФайлы,
		"Наименование",
		НСтр("ru = 'ГОСТ Р 53898-2010'; en = 'GOST R 53898-2010'"));

	// Справочники.ШаблоныГруппКонтрольныхТочек.

	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныГруппКонтрольныхТочек.Все,
		"Наименование",
		НСтр("ru = 'Все'; en = 'All'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныГруппКонтрольныхТочек.НеВГруппе,
		"Наименование",
		НСтр("ru = 'Не в группе'; en = 'Not in group'"));

	// ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Контрагент,
		"Наименование",
		НСтр("ru = 'Контрагент'; en = 'Counterparty'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.ВсеОбъектыАдресации,
		"Наименование",
		НСтр("ru = 'Все объекты адресации'; en = 'All addressing objects'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Проект,
		"Наименование",
		НСтр("ru = 'Проект'; en = 'Project'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Подразделение,
		"Наименование",
		НСтр("ru = 'Подразделение'; en = 'Department'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация,
		"Наименование",
		НСтр("ru = 'Организация'; en = 'Company'"));

	// ПланыВидовХарактеристик.ВидыДоступа.

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ВидыВходящихДокументов,
		"Наименование",
		НСтр("ru = 'Виды входящих документов'; en = 'Incoming document types'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ВидыИсходящихДокументов,
		"Наименование",
		НСтр("ru = 'Виды исходящих документов'; en = 'Outgoing document types'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Организации,
		"Наименование",
		НСтр("ru = 'Организации'; en = 'Companies'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ГрифыДоступа,
		"Наименование",
		НСтр("ru = 'Грифы доступа'; en = 'Security levels'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ГруппыДоступаКонтрагентов,
		"Наименование",
		НСтр("ru = 'Группы доступа контрагентов'; en = 'Counterparties access groups'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ВидыВнутреннихДокументов,
		"Наименование",
		НСтр("ru = 'Виды внутренних документов'; en = 'Internal document types'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ГруппыДоступаФизическихЛиц,
		"Наименование",
		НСтр("ru = 'Группы доступа физических лиц'; en = 'Individuals access groups'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ВопросыДеятельности,
		"Наименование",
		НСтр("ru = 'Вопросы деятельности'; en = 'Activity types'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.ВидыМероприятий,
		"Наименование",
		НСтр("ru = 'Виды мероприятий'; en = 'Event types'"));

	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Подразделения,
		"Наименование",
		НСтр("ru = 'Подразделения'; en = 'Departments'"));

КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации  = "ДокументооборотКОРП";
	Обработчик.Процедура = "ЛокализацияКонфигурацииПереопределяемый.УстановитьКодЯзыкаПользователей";
	
КонецПроцедуры

// Вызвается при определении представления типа для указанного пользователя.
//
// Параметры:
//   Тип - Тип - тип, представление которого следует определить.
//   Пользователь - СправочникСсылка.Пользователи - пользователь, которому нужно представление.
//   Представление - Строка - локализованное для пользователя представление, или
//                 - Неопределено - признак стандартной обработки.
//
Процедура ПриОпределенииПредставленияТипаДляПользователя(Тип, Пользователь, Представление) Экспорт
	
	Если ЛокализацияКонфигурацииПовтИсп.КодЯзыкаПользователя(Пользователь) <> "en" Тогда
		Возврат;
	КонецЕсли;
	
	Если Тип = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		Представление = "Internal document";
	ИначеЕсли Тип = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		Представление = "Incoming document";
	ИначеЕсли Тип = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		Представление = "Outgoing document";
	ИначеЕсли Тип = Тип("СправочникСсылка.ТемыОбсуждений") Тогда
		Представление = "Forum thread";
	ИначеЕсли Тип = Тип("СправочникСсылка.СообщенияОбсуждений") Тогда
		Представление = "Forum message";
	ИначеЕсли Тип = Тип("СправочникСсылка.ЗаписиРабочегоКалендаря") Тогда
		Представление = "Calendar entry";
	ИначеЕсли Тип = Тип("СправочникСсылка.КатегорииДанных") Тогда
		Представление = "Data category";
	ИначеЕсли Тип = Тип("СправочникСсылка.Контроль") Тогда
		Представление = "Monitoring";
	ИначеЕсли Тип = Тип("СправочникСсылка.Контрагенты") Тогда
		Представление = "Counterparty";
	ИначеЕсли Тип = Тип("СправочникСсылка.Мероприятия") Тогда
		Представление = "Event";
	ИначеЕсли Тип = Тип("СправочникСсылка.ПапкиВнутреннихДокументов") Тогда
		Представление = "Internal document folder";
	ИначеЕсли Тип = Тип("СправочникСсылка.ПапкиФайлов") Тогда
		Представление = "File folder";
	ИначеЕсли Тип = Тип("СправочникСсылка.ПоказателиПроцессов") Тогда
		Представление = "Process metric";
	ИначеЕсли Тип = Тип("СправочникСсылка.Пользователи") Тогда
		Представление = "User";
	ИначеЕсли Тип = Тип("СправочникСсылка.ПроектныеЗадачи") Тогда
		Представление = "Project task";
	ИначеЕсли Тип = Тип("СправочникСсылка.Проекты") Тогда
		Представление = "Project";
	ИначеЕсли Тип = Тип("СправочникСсылка.ТерриторииИПомещения") Тогда
		Представление = "Premise or site";
	ИначеЕсли Тип = Тип("СправочникСсылка.УведомленияПрограммы") Тогда
		Представление = "Program notification";
	ИначеЕсли Тип = Тип("СправочникСсылка.Файлы") Тогда
		Представление = "File";
	ИначеЕсли Тип = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Представление = "Performer task";
	ИначеЕсли Тип = Тип("ДокументСсылка.Бронь") Тогда
		Представление = "Reservation";
	ИначеЕсли Тип = Тип("ДокументСсылка.Отсутствие") Тогда
		Представление = "Absence";
	ИначеЕсли Тип = Тип("ДокументСсылка.Отсутствие") Тогда
		Представление = "Absence";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Исполнение") Тогда
		Представление = "Performance";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.КомплексныйПроцесс") Тогда
		Представление = "Composite process";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.ОбработкаВнутреннегоДокумента") Тогда
		Представление = "Internal document processing";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.ОбработкаВходящегоДокумента") Тогда
		Представление = "Incoming document processing";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.ОбработкаИсходящегоДокумента") Тогда
		Представление = "Outgoing document processing";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Ознакомление") Тогда
		Представление = "Examination";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Поручение") Тогда
		Представление = "Order";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Приглашение") Тогда
		Представление = "Invitation";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Рассмотрение") Тогда
		Представление = "Reviewal";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Регистрация") Тогда
		Представление = "Registration";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.РешениеВопросовВыполненияЗадач") Тогда
		Представление = "Issue solving";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Согласование") Тогда
		Представление = "Approval";
	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.Утверждение") Тогда
		Представление = "Confirmation";
	КонецЕсли;
	
КонецПроцедуры

// Вызвается при определении кода языка исполнителя задачи. Позволяет переопределить стандартное
// поведение.
//
// Параметры:
//   Задача - ЗадачаОбъект.ЗадачаИсполнителя - задача, для которой определяется код языка.
//   КодЯзыка - Строка - переопределенный код языка, или
//            - Неопределено - признак необходимости выполнить стандартное определение.
//
Процедура ПриОпределенииКодаЯзыкаИсполнителяЗадачи(Задача, КодЯзыка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при переходе на локализованную редакцию. Устанавливает код языка в справочнике "Пользователи"
// по данным пользователей ИБ.
//
Процедура УстановитьКодЯзыкаПользователей() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ <> &ПустойУникальныйИдентификатор");
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		Если ПользовательИБ = Неопределено
			Или ПользовательИБ.Язык = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПользовательОбъект = Выборка.Пользователь.ПолучитьОбъект();
		ПользовательОбъект.КодЯзыка = ПользовательИБ.Язык.КодЯзыка;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПользовательОбъект);
		
	КонецЦикла;

КонецПроцедуры

// Вызывается при обновлении на 2.1.1.1 и дает локализованные наименования справочнику "Уровни доступа".
//
Процедура ПерейтиНаВерсию_2_1_1_1() Экспорт
	
	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Регистрация,
		"Наименование",
		НСтр("ru = 'Регистрация'; en = 'Register'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Редактирование,
		"Наименование",
		НСтр("ru = 'Редактирование'; en = 'Change'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Чтение,
		"Наименование",
		НСтр("ru = 'Чтение'; en = 'Read'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.6.1 и корректирует перевод термина "Организация".
//
Процедура ПерейтиНаВерсию_2_1_6_1() Экспорт
	
	Справочники.АдреснаяКнига.ОбновитьСпискиАвтоподстановок();
	
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация,
		"Наименование",
		НСтр("ru = 'Организация'; en = 'Company'"));
		
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Организации,
		"Наименование",
		НСтр("ru = 'Организации'; en = 'Companies'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникОрганизации,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Организации""'; en = 'Contact information for catalog ""Companies""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_БанковскиеСчетаОрганизации,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Банковские счета"" (организации)'; en = 'Add. properties of catalog ""Bank accounts"" (legal companies)'"));
		
	// Автоподстановки в рабочих группах шаблонов.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочаяГруппаДокумента.Ссылка
		|ИЗ
		|	Справочник.ШаблоныВнутреннихДокументов.РабочаяГруппаДокумента КАК РабочаяГруппаДокумента
		|ГДЕ
		|   РабочаяГруппаДокумента.Участник = &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочаяГруппаДокумента.Ссылка
		|ИЗ
		|	Справочник.ШаблоныВходящихДокументов.РабочаяГруппаДокумента КАК РабочаяГруппаДокумента
		|ГДЕ
		|   РабочаяГруппаДокумента.Участник = &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочаяГруппаДокумента.Ссылка
		|ИЗ
		|	Справочник.ШаблоныИсходящихДокументов.РабочаяГруппаДокумента КАК РабочаяГруппаДокумента
		|ГДЕ
		|   РабочаяГруппаДокумента.Участник = &ЗаменяемаяСтрока
		|");
	Запрос.УстановитьПараметр("ЗаменяемаяСтрока", "Head of the entity");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИзменяемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НужнаЗапись = Ложь;
		Для Каждого СтрокаУчастника Из ИзменяемыйОбъект.РабочаяГруппаДокумента Цикл
			Если СтрокаУчастника.Участник = "Head of the entity" Тогда
				НужнаЗапись = Истина;
				СтрокаУчастника.Участник = "Head of the company";
			КонецЕсли;
		КонецЦикла;
		Если НужнаЗапись Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ИзменяемыйОбъект);
		КонецЕсли;
	КонецЦикла;
	
	// Автоподстановки в шаблонах процессов.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныИсполнения КАК Шаблон
		|ГДЕ
		|   Шаблон.Контролер ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныИсполнения КАК Шаблон
		|ГДЕ
		|   Шаблон.Проверяющий ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ШаблонИсполнители.Ссылка
		|ИЗ
		|	Справочник.ШаблоныИсполнения.Исполнители КАК ШаблонИсполнители
		|ГДЕ
		|   ШаблонИсполнители.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныКомплексныхБизнесПроцессов КАК Шаблон
		|ГДЕ
		|   Шаблон.Контролер ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонИсполнители.Ссылка
		|ИЗ
		|	Справочник.ШаблоныОзнакомления.Исполнители КАК ШаблонИсполнители
		|ГДЕ
		|   ШаблонИсполнители.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныПоручения КАК Шаблон
		|ГДЕ
		|   Шаблон.Контролер ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныПоручения КАК Шаблон
		|ГДЕ
		|   Шаблон.Проверяющий ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныПоручения КАК Шаблон
		|ГДЕ
		|   Шаблон.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонИсполнители.Ссылка
		|ИЗ
		|	Справочник.ШаблоныПриглашения.Исполнители КАК ШаблонИсполнители
		|ГДЕ
		|   ШаблонИсполнители.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныРассмотрения КАК Шаблон
		|ГДЕ
		|   Шаблон.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныРегистрации КАК Шаблон
		|ГДЕ
		|   Шаблон.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШаблонИсполнители.Ссылка
		|ИЗ
		|	Справочник.ШаблоныСогласования.Исполнители КАК ШаблонИсполнители
		|ГДЕ
		|   ШаблонИсполнители.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шаблон.Ссылка
		|ИЗ
		|	Справочник.ШаблоныУтверждения КАК Шаблон
		|ГДЕ
		|   Шаблон.Исполнитель ПОДОБНО &ЗаменяемаяСтрока
		|
		|");
	Запрос.УстановитьПараметр("ЗаменяемаяСтрока", "%.Head of the entity");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИзменяемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НужнаЗапись = Ложь;
		Если ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныИсполнения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныОзнакомления")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныПриглашения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныСогласования") Тогда
			Для Каждого СтрокаИсполнитель Из ИзменяемыйОбъект.Исполнители Цикл
				Если СтрЗаканчиваетсяНа(СтрокаИсполнитель.Исполнитель, ".Head of the entity") Тогда
					НужнаЗапись = Истина;
					СтрокаИсполнитель.Исполнитель = СтрЗаменить(СтрокаИсполнитель.Исполнитель,
						".Head of the entity",
						".Head of the company");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныИсполнения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныПоручения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныКомплексныхБизнесПроцессов") Тогда
			Если СтрЗаканчиваетсяНа(ИзменяемыйОбъект.Контролер, ".Head of the entity") Тогда
				НужнаЗапись = Истина;
				ИзменяемыйОбъект.Контролер = СтрЗаменить(ИзменяемыйОбъект.Контролер,
					".Head of the entity",
					".Head of the company");
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныИсполнения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныПоручения") Тогда
			Если СтрЗаканчиваетсяНа(ИзменяемыйОбъект.Проверяющий, ".Head of the entity") Тогда
				НужнаЗапись = Истина;
				ИзменяемыйОбъект.Проверяющий = СтрЗаменить(ИзменяемыйОбъект.Проверяющий,
					".Head of the entity",
					".Head of the company");
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныПоручения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныРассмотрения")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныРегистрации")
			Или ТипЗнч(ИзменяемыйОбъект) = Тип("СправочникОбъект.ШаблоныУтверждения") Тогда
			Если СтрЗаканчиваетсяНа(ИзменяемыйОбъект.Исполнитель, ".Head of the entity") Тогда
				НужнаЗапись = Истина;
				ИзменяемыйОбъект.Исполнитель = СтрЗаменить(ИзменяемыйОбъект.Исполнитель,
					".Head of the entity",
					".Head of the company");
			КонецЕсли;
		КонецЕсли;
		Если НужнаЗапись Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ИзменяемыйОбъект);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.СодержитСсылкуНаИнтегрированныйОбъект,
		"Наименование",
		НСтр("ru = 'Содержит ссылку на'; en = 'Contains reference to'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправлениеПисьма,
		"Наименование",
		НСтр("ru = 'Перенаправление письма'; en = 'Email forwarding'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправленоПисьмом,
		"Наименование",
		НСтр("ru = 'Перенаправлено письмом'; en = 'Forwarded by email'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.7.9 и дает локализованные наименования новым предопределенным элементам данных.
//
Процедура ПерейтиНаВерсию_2_1_7_9() Экспорт
	
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Подразделения,
		"Наименование",
		НСтр("ru = 'Подразделения'; en = 'Departments'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.8.11 и дает локализованные наименования новым предопределенным элементам данных.
//
Процедура ПерейтиНаВерсию_2_1_8_11() Экспорт
	
	// Справочники.НаименованияСторон.

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Заказчик,
		"Наименование",
		НСтр("ru = 'Заказчик'; en = 'Customer'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Исполнитель,
		"Наименование",
		НСтр("ru = 'Исполнитель'; en = 'Contractor'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Покупатель,
		"Наименование",
		НСтр("ru = 'Покупатель'; en = 'Buyer'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Продавец,
		"Наименование",
		НСтр("ru = 'Продавец'; en = 'Seller'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет реквизиты предопределенного элемента (необходимо для локализации).
//
Процедура ОбновитьПредопределенныйЭлемент(ПредопределенныйЭлемент, 
	ИмяРеквизита1 = Неопределено, ЗначениеРеквизита1 = Неопределено,
	ИмяРеквизита2 = Неопределено, ЗначениеРеквизита2 = Неопределено,
	ИмяРеквизита3 = Неопределено, ЗначениеРеквизита3 = Неопределено)
	
	Элемент = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	НужнаЗапись = Ложь;
	
	Если ИмяРеквизита1 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита1) Тогда
		Если Элемент[ИмяРеквизита1] <> ЗначениеРеквизита1 Тогда
			Элемент[ИмяРеквизита1] = ЗначениеРеквизита1;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРеквизита2 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита2)  Тогда
		Если Элемент[ИмяРеквизита2] <> ЗначениеРеквизита2 Тогда
			Элемент[ИмяРеквизита2] = ЗначениеРеквизита2;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРеквизита3 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита3) Тогда
		Если Элемент[ИмяРеквизита3] <> ЗначениеРеквизита3 Тогда
			Элемент[ИмяРеквизита3] = ЗначениеРеквизита3;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти