
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения(
		"ОбработкаКомандыЗавершение",
		ЭтотОбъект,
		ПараметрКоманды);
 
    ПоказатьВводСтроки(
        Оповещение,
        ,
        НСтр("ru = 'Причина аннулирования'; en = 'Annul reason'"),
        0,
        Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат = "" Тогда
		ТекстОшибки = НСтр("ru = 'Причина не указана'; en = 'Annul reason is not specified'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ВыполнитьАннулированиеНаСервере(Параметры, Результат);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАннулированиеНаСервере(МассивОбъектов, ПричинаАннулирования)
	
	Для Каждого ДокументСсылка Из МассивОбъектов Цикл
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ДополнительныеСвойства.Вставить("Cancellation", Истина);
		ДокументОбъект.PrichinaAnnulirovaniya = ПричинаАннулирования;
		ДокументОбъект.Записать();
						
	КонецЦикла;
			
КонецПроцедуры
