////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ДЛЯ РАБОТЫ С РЕЗОЛЮЦИЯМИ (КЛИЕНТ-СЕРВЕР)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьНаименованиеРезолюции(Документ) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Резолюция документа ""%1""'; en = 'Resolution of document ""%1""'"), Строка(Документ));
	
КонецФункции

Функция СообщениеДоступНаУдалениеЗакрыт() Экспорт
	
	Возврат НСтр("ru = 'Удалить резолюцию может только автор либо внесший.'; en = 'Only the author and the user who entered it can delete the resloution.'");
	
КонецФункции

Функция ПолучитьИнформациюОбЭПРезолюции(Резолюция) Экспорт
	
	Результат = "";
	
	Если Не Резолюция.Подписана Тогда
		Возврат НСтр("ru = 'Не подписана'; en = 'Not signed'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Резолюция.ДатаПроверкиПодписи) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, подпись не проверена'; en = '%1, signature not validated'"),
			Резолюция.ДатаПодписи);
	КонецЕсли;
	
	Если Не Резолюция.ПодписьВерна Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1, подпись неверна'; en = '%1, signature invalid'"),
			Резолюция.ДатаПодписи);
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1, подпись верна'; en = '%1, signature valid'"),
		Резолюция.ДатаПодписи);
	
КонецФункции

#КонецОбласти
