
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

Функция ПолучитьСхемуКомпоновкиДанныхДляОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СхемаКомпоновкиДанных", ПолучитьСхемуКомпоновкиДанных());
	Результат.Вставить("URLСхемы", ПоместитьВоВременноеХранилище(Результат.СхемаКомпоновкиДанных, Новый УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСхемуКомпоновкиДанных() Экспорт
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	//ИсточникДанных = КомпоновкаДанныхКлиентСервер.ДобавитьЛокальныйИсточникДанных(СхемаКомпоновкиДанных);
	//
	//НаборДанных = КомпоновкаДанныхКлиентСервер.ДобавитьНаборДанныхОбъединение(СхемаКомпоновкиДанных);
	//
	//СформироватьНаборыДанныхРегистровНакопления(НаборДанных, ИсточникДанных);
	//
	//СхемаКомпоновкиДанных.ВариантыНастроек.Очистить();
	//
	//ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Добавить();
	//ВариантНастроек.Имя = "Вертикально";
	//ВариантНастроек.Представление = "Вертикально";
	//СформироватьНастройкиВариантаНастроекРегистровНакопления(ВариантНастроек.Настройки, РасположениеПоляКомпоновкиДанных.Вертикально);
	//
	//ВариантНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор("2665a7b4-20af-4b6d-ab12-4f307bbe7a27");
	//
	//ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Добавить();
	//ВариантНастроек.Имя = "Горизонтально";
	//ВариантНастроек.Представление = "Горизонтально";
	//СформироватьНастройкиВариантаНастроекРегистровНакопления(ВариантНастроек.Настройки, РасположениеПоляКомпоновкиДанных.Горизонтально);
	//
	//ВариантНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор("2665a7b4-20af-4b6d-ab12-4f307bbe7a27");
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Структура = ПолучитьСхемуКомпоновкиДанныхДляОтчета();

СхемаКомпоновкиДанных = Структура.СхемаКомпоновкиДанных;
URLСхемы = Структура.URLСхемы;

