
&НаСервере
Процедура Команда1НаСервере()
	
	Выборка = Документы.ra_Uvedomlenie.Выбрать();
	Выборка.Следующий();
	
	ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
	ТаблицаНастроек1 = Документы.ra_Uvedomlenie.СформироватьМассивДанныхРолевойМодели(ДокументОбъект);
	
	Оп1 = Обработки.ра_ФормыБитрикс.ПолучитьHTTPОтветJSON(ТаблицаНастроек1);
	
	ОбработкаОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ра_ФормыБитрикс"));
	
	ТаблицаНастроек2 = ОбработкаОбъект.ОписаниеФормы(Метаданные.Документы.ra_Uvedomlenie, ДокументОбъект);
	
	Оп2 = Обработки.ра_ФормыБитрикс.ПолучитьHTTPОтветJSON(ТаблицаНастроек2);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

