
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	FormaOS = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаФормыОС", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение, FormaOS, "Выберете форму ОС", Новый ОписаниеТипов("ПеречислениеСсылка.ra_FormyOS"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаФормыОС(FormaOS, Параметры) Экспорт
	
	Если FormaOS <> Неопределено Тогда
        П = Новый Структура("FormaOS", FormaOS);
		ОткрытьФорму("Документ.ra_ZayavkaNaOcenkuSootvetstviya3.ФормаОбъекта", П);
	КонецЕсли;
	
КонецПроцедуры