
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 1 Тогда
		
		СтрокаНабора = ЭтотОбъект[0];
		
		Если ра_ОбщегоНазначенияКлиентСервер.ЭтоДокументКачества(СтрокаНабора.Документ, "УправлениеНесоответствиями") Тогда
			
			СведенияОСтатусеНС = Документы.ra_Nesootvetstvie.СведенияОСтатусеНесоответствия(
				СтрокаНабора.Документ, СтрокаНабора.Состояние);
			
			Если СведенияОСтатусеНС.ТребуетсяОбновить Тогда
				Делопроизводство.ЗаписатьСостояниеДокумента(
					СведенияОСтатусеНС.Несоответствие,
					СтрокаНабора.Период,
					СведенияОСтатусеНС.Состояние,
					СтрокаНабора.Установил);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти