
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура VneshniyNomerПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование(Объект.VneshniyNomer, Объект.DataPodpisaniya);
	Объект.NaimenovanieEn = СформироватьНаименование(Объект.VneshniyNomer, Объект.DataPodpisaniya, "en");
	
КонецПроцедуры

&НаКлиенте
Процедура DataPodpisaniyaПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьНаименование(Объект.VneshniyNomer, Объект.DataPodpisaniya);
	Объект.NaimenovanieEn = СформироватьНаименование(Объект.VneshniyNomer, Объект.DataPodpisaniya, "en");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьНаименование(НомерДоговора, ДатаДоговора, КодЯзыка = "ru")
	
	Если КодЯзыка = "ru" Тогда
		ТекстШаблона = "№ %1 от %2";
	ИначеЕсли КодЯзыка = "en" Тогда
		ТекстШаблона = "# %1 dated %2";
	КонецЕсли;
	
	Возврат СтрШаблон(ТекстШаблона, НомерДоговора, Формат(ДатаДоговора, "ДФ=dd.MM.yyyy"));
		
КонецФункции

#КонецОбласти
