
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Хранилище = Константы.ра_ПараметрыТестирования.Получить();

	ТаблицаЗначений = Хранилище.Получить();
	Если ЗначениеЗаполнено(ТаблицаЗначений) Тогда
		Для Каждого Строка Из ТаблицаЗначений Цикл
			СтрокаТЧ = ПараметрыТестирования.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьПараметрыТестированияНаСервере();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПараметры(Команда)
	
	ЗаписатьПараметрыТестированияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыТестированияНаСервере()
		
	Хранилище = Новый ХранилищеЗначения(ПараметрыТестирования.Выгрузить());
	Константы.ра_ПараметрыТестирования.Установить(Хранилище);
	
КонецПроцедуры