
Функция MTRClassUpdate(MTRClass)
	
	ВидИнтеграции = Перечисления.ра_ВидыИнтеграций.EOSNSI_ClassMTR;
	
	Попытка
		Если Константы.ра_ИспользоватьВнешнююОбработкуИнтеграции.Получить() Тогда
			//внешняя обработка
			во = ВнешниеОбработки.Создать(Константы.ра_ПутьКОбработкеВебСервисовИнтеграции.Получить(), Ложь);
			Результат = во.ВыполнитьСценарийЗагрузкиКлассификатораMTR(MTRClass);        
		Иначе
			Результат = Обработки.ра_Интеграция.ВыполнитьСценарийЗагрузкиКлассификатораMTR(MTRClass);
		КонецЕсли;

		ПредставлениеЗагруженногоОбъекта = ?(Результат.Ссылки.Количество()>1, Неопределено, Результат.Ссылки[0].Значение); 
		Обработки.ра_Интеграция.ДобавитьЗаписьВЖурналОбмена(ПредставлениеЗагруженногоОбъекта, ФабрикаXDTO ,ВидИнтеграции,"Классификатор МТР успешно загружен" + Символы.ПС + Результат.СтрокоеПредставлениеСсылок,, Ложь,?(Результат.Ссылки.Количество()>1, Ложь, Истина),Истина,,,MTRClass);
		
	Исключение
		Обработки.ра_Интеграция.ДобавитьЗаписьВЖурналОбмена(, ФабрикаXDTO ,ВидИнтеграции,"При загрузке классификатора МТР произошла ошибка: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),,Истина, Истина,Истина,,,MTRClass);
	КонецПопытки;	
		
	Возврат Результат.Результат;
	
КонецФункции
