#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОпределитьОбъемРабот(МестоВыявления, Повторяемость, ВлияниеНаЭксплуатацию, ВлияниеНаГрафик, ВлияниеНаБюджет) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("МестоВыявления", МестоВыявления);
	Параметры.Вставить("Повторяемость", Повторяемость);
	Параметры.Вставить("ВлияниеНаЭксплуатацию", ВлияниеНаЭксплуатацию);
	Параметры.Вставить("ВлияниеНаГрафик", ВлияниеНаГрафик);
	Параметры.Вставить("ВлияниеНаБюджет", ВлияниеНаБюджет);
	
	Результат = РегистрыСведений.ра_ПравилаОпределенияОбъемовРабот.Получить(Параметры);
	
	Если ЗначениеЗаполнено(Результат.ОбъемРабот) Тогда
		Возврат Результат.ОбъемРабот;
	Иначе
		Возврат Перечисления.ra_ObemyRabot.D3;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли