
////////////////////////////////////////////////////////////////////////////////
// Шаблоны бизнес процессов переопределяемый: модуль содержит переопределяемые процедуры и функции
//                                            для шаблонов процессов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает список пользовательских функций для автоподстановки исполнителей в шаблонах бизнес-процессов
// Параметры:
//	ИменаПредметовДляФункций - массив - массив имен предметов для функций автоподстановки
//
Функция ПолучитьСписокДоступныхФункций(ИменаПредметовДляФункций) Экспорт
	
	ДоступныеФункции = Новый СписокЗначений;
	//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.<ИмяФункции>(Объект)", "<Представление функции>");
	//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ЗаместительРуководителяАвтораПроцесса(Объект)", "Заместитель руководителя автора процесса");
	
	// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 29.06.2018 {
	// добавим автоподстановки для процессов
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	Языки = Новый Массив;
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Языки.Добавить(Пользователь.КодЯзыка);
	ИНаче
		Для Каждого Язык из Метаданные.Языки Цикл
			Языки.Добавить(Язык.КодЯзыка);
		КонецЦикла;
	КонецЕсли;
		
	Для Каждого КодЯзыка из Языки Цикл
		Если ИменаПредметовДляФункций <> Неопределено Тогда
			Если ИменаПредметовДляФункций.Количество() > 0 Тогда
				Для Каждого ИмяПредмета Из ИменаПредметовДляФункций Цикл
					
					// Для документа Уведомление о несоответствии
					
					// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 06.07.2018 {
					// пока отключу НСТР, из-за не ошибка возникает
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.СогласовантыУведомленияОНесоответствии(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Согласование УоН",Строка(ИмяПредмета)));
						
					// Заполнение подписантов
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ПодписантыУведомленияОНесоответствии(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Подписание УоН",Строка(ИмяПредмета)));
						
					// Заполнение ознакомления (для организации-допустивщей несоответствие)
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОзнакомлениеСПодписаннымУведомлениемОНесоответствии(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление с подписанным УоН",Строка(ИмяПредмета)));
						
					// Заполнение ознакомления (после того, как ответственный за качество допустившей организации принял уведомление)
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОзнакомлениеПринятиемУведомлениемОНесоответствии(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление с принятием УоН ДО",Строка(ИмяПредмета)));	
						
					// Для документов "ВСД и коррекция" // заполнение ответственного за качество допустившей организации
					
					// Заполнение согласовантом
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ИсполнитьВСДИКоррекция(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Исполнение ВСД и коррекция",Строка(ИмяПредмета)));
						
					// Заполнение согласовантом
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОзнакомитьсяВСДИКоррекция(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление ВСД и коррекция",Строка(ИмяПредмета)));	
						
					// Для документов "Акт об устранении несоответствия", "Отчет о несоответствии, часть 1"
					
					// Заполнение согласовантом
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.СогласовантыАктаИОтчетаЧ1(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Согласование Акта, Отчета Ч1",Строка(ИмяПредмета)));
						
					// Заполнение подписантов
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ПодписантыАктаИОтчетаЧ1(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Подписание Акта, Отчета Ч1",Строка(ИмяПредмета)));
						
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОтветственныйЗаКачествоСоСтороныЗаявителя(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление ОзК от заявителя",Строка(ИмяПредмета)));
						
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.КомандаДляОзнакомленияСАннулированиемНС(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление с аннулированием НС", Строка(ИмяПредмета)));
						
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОзнакомлениеССигналом(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Ознакомление с сигналом", Строка(ИмяПредмета)));
						
					//Роли для Заявка КО
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.РуководительКонтролераКО(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Руководитель контролера (КО)", Строка(ИмяПредмета)));
						
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.КонтролерКО(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Контролер (КО)", Строка(ИмяПредмета)));
						
					ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.УчастникиКО(Объект, ИмяПредмета)",
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.Участники (КО)", Строка(ИмяПредмета)));
						
					// Заполнение согласовантом
					//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.СогласовантыУведомленияОНесоответствии(Объект, ИмяПредмета)",
					//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.Согласование УоН'; en = '%1.Matching of the notification'", КодЯзыка),Строка(ИмяПредмета)));
					//	
					//// Заполнение подписантов
					//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ПодписантыУведомленияОНесоответствии(Объект, ИмяПредмета)",
					//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.Подписание УоН'; en = '%1.Signers of the notification'", КодЯзыка),Строка(ИмяПредмета)));
					//	
					//// Заполнение ознакомления (для организации-допустивщей несоответствие)
					//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ОзнакомлениеСПодписаннымУведомлениемОНесоответствии(Объект, ИмяПредмета)",
					//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.Ознакомление с подписанным УоН'; en = '%1.Read of the notification'", КодЯзыка),Строка(ИмяПредмета)));
					//	
					//// Для документов "Акт об устранении несоответствия", "Отчет о несоответствии, часть 1"
					//
					//// Заполнение согласовантом
					//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.СогласовантыАктаИОтчетаЧ1(Объект, ИмяПредмета)",
					//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.Согласование Акта, Отчета Ч1'; en = '%1.Matching of the Act, report1'", КодЯзыка),Строка(ИмяПредмета)));
					//	
					//// Заполнение подписантов
					//ДоступныеФункции.Добавить("ШаблоныБизнесПроцессовПереопределяемый.ПодписантыАктаИОтчетаЧ1(Объект, ИмяПредмета)",
					//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.Подписание Акта, Отчета Ч1'; en = '%1.Signers of the Act, report1'", КодЯзыка),Строка(ИмяПредмета)));
					// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 06.07.2018 } 
						
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 29.06.2018 }
	
	Возврат ДоступныеФункции;
	
КонецФункции	

// Возвращает роль заместителя руководителя подразделения, в которое входит автор процесса.
// Функция является примером автоподстановки, возвращающей роль с объектом адресации.
//
// Параметры: 
//    БизнесПроцессОбъект - бизнес-процесс, в котором сработала автоподстановка
//
// Возвращаемое значение:
//    Структура со следующими полями:
//    РольИсполнителя – Справочники.РолиИсполнителей – роль "Заместитель руководителя подразделения"
//    ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - подразделение автора процесса
//    ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - неопределено
//
//Функция ЗаместительРуководителяАвтораПроцесса(БизнесПроцессОбъект) Экспорт
//	
//	АвторБизнесПроцесса = БизнесПроцессОбъект.Автор;
//
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	СведенияОПользователяхДокументооборот.Подразделение КАК Подразделение
//	|ИЗ
//	|	РегистрСведений.СведенияОПользователяхДокументооборот КАК СведенияОПользователяхДокументооборот
//	|ГДЕ
//	|	СведенияОПользователяхДокументооборот.Пользователь = &Пользователь";
//	Запрос.УстановитьПараметр("Пользователь", АвторБизнесПроцесса);
//	
//	Результат = Запрос.Выполнить();
//	Подразделение = Неопределено;
//	
//	Если Не Результат.Пустой() Тогда 
//		Выборка = Результат.Выбрать();
//		Выборка.Следующий();
//		Подразделение = Выборка.Подразделение;
//	КонецЕсли;	
//	
//	СтруктураАдресации = Новый Структура;
//	СтруктураАдресации.Вставить("РольИсполнителя", 
//		Справочники.РолиИсполнителей.НайтиПоНаименованию("Заместитель руководителя подразделения"));
//	СтруктураАдресации.Вставить("ОсновнойОбъектАдресации", Подразделение);
//	СтруктураАдресации.Вставить("ДополнительныйОбъектАдресации", Неопределено);  
//		  	
//	Возврат СтруктураАдресации;
//	
//КонецФункции

// Вызывается из ШаблоныБизнесПроцессов.ОбновитьДоступностьЗависимыхШаблонов при
// обновлении доступности зависимых шаблонов.
//
// Параметры:
//  Шаблон - Структура - 
//  СтандартнаяОбработка – Булево - В случае значения Истина обновление доступности
//                         будет выполнено способом по умолчанию.
//
Процедура ПриОбновленииДоступностиЗависимыхШаблонов(Шаблон, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 29.06.2018 {
// процедуры для автоподстановок для процессов	

Функция СогласовантыУведомленияОНесоответствии(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_Uvedomlenie") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_UvedomlenieSoglasuyushchie.Polzovatel КАК Polzovatel
		|ИЗ
		|	Документ.ra_Uvedomlenie.Soglasuyushchie КАК ra_UvedomlenieSoglasuyushchie
		|ГДЕ
		|	ra_UvedomlenieSoglasuyushchie.Polzovatel <> &ПустойПользователь
		|	И ra_UvedomlenieSoglasuyushchie.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Polzovatel");
		
		Если МассивУчастников.Количество() = 0 Тогда
			// добавим служебного пользователя DORobot. Задача согласования по нему выполнится автоматически с помощью функционала эскалации
			СлужебныйПользователь = Справочники.Пользователи.НайтиПоНаименованию("DORobot");
			Если ЗначениеЗаполнено(СлужебныйПользователь) Тогда 
				МассивУчастников.Добавить(СлужебныйПользователь);
			КонецЕсли;
		КонецЕсли;
		
		Если МассивУчастников.Количество() = 0 Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция ПодписантыУведомленияОНесоответствии(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	Участник = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_Uvedomlenie") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_Uvedomlenie.OtvetstvennyjZaKachestvoOtpravitel КАК OtvetstvennyjZaKachestvo
		|ИЗ
		|	Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
		|ГДЕ
		|	ra_Uvedomlenie.OtvetstvennyjZaKachestvoOtpravitel <> &ПустойПользователь
		|	И ra_Uvedomlenie.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Участник = Выборка.OtvetstvennyjZaKachestvo;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Участник) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция ОзнакомлениеСПодписаннымУведомлениемОНесоответствии(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	Предмет = Неопределено;
	
	Если ТипЗнч(БизнесПроцессОбъект) = тип("БизнесПроцессОбъект.Исполнение") Тогда
		Предмет = БизнесПроцессОбъект.ra_DopPredmet;
	Иначе
		СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
		Если СтрокаПредмета <> Неопределено Тогда
			Предмет = СтрокаПредмета.Предмет;
		КонецЕсли;
	КонецЕсли;
	
	Если Предмет = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
	КонецЕсли;
	
	МассивУчастников = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Предмет) Тогда 
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
			Строка(ИмяПредмета));
	КонецЕсли;
	
	Если ТипЗнч(Предмет) <> Тип("ДокументСсылка.ra_Uvedomlenie") Тогда 
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
			Строка(ИмяПредмета));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ra_Uvedomlenie.OtvetstvennyjZaKachestvoPoluchatel КАК Otvetstvennyj
	|ИЗ
	|	Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
	|ГДЕ
	|	ra_Uvedomlenie.OtvetstvennyjZaKachestvoPoluchatel <> &ПустойПользователь
	|	И ra_Uvedomlenie.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Предмет);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
	
	МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Otvetstvennyj");
	
	Если МассивУчастников.Количество() = 0 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
			Строка(Предмет));
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция ОзнакомлениеПринятиемУведомлениемОНесоответствии(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета, "ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_Uvedomlenie") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_Uvedomlenie.OtvetstvennyjZaKachestvoOtpravitel КАК OtvetstvennyjZaKachestvo,
		|	ra_Uvedomlenie.VidOperacii КАК VidOperacii
		|ИЗ
		|	Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
		|ГДЕ
		|	ra_Uvedomlenie.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МассивУчастников.Добавить(Выборка.OtvetstvennyjZaKachestvo);
			
			Если Выборка.VidOperacii = Перечисления.ra_VidyUvedomleniy.UvedomlenieVnutriOrganizacii И МассивУчастников.Количество() = 0 Тогда
				СлужебныйПользователь = Справочники.Пользователи.НайтиПоНаименованию("DORobot");
				Если ЗначениеЗаполнено(СлужебныйПользователь) Тогда
					МассивУчастников.Добавить(СлужебныйПользователь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивУчастников.Количество() = 0 Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция СогласовантыАктаИОтчетаЧ1(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_AktObUstraneniiNesootvetstviya")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast1")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast2")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast3")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ItogovyjOtchetONesootvetstvii") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Doc.Polzovatel КАК Polzovatel
		|ИЗ
		|	&Документ КАК Doc
		|ГДЕ
		|	Doc.Ссылка = &Ссылка
		|	И Doc.EtapSoglasovanie
		|	И Doc.Polzovatel <> &ПустойПользователь";
		
		Если ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_AktObUstraneniiNesootvetstviya") Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_AktObUstraneniiNesootvetstviya.Soglasuyushchie"); 		
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast1") Тогда  
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast1.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast2") Тогда  
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast2.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast3") Тогда  
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast3.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_ItogovyjOtchetONesootvetstvii") Тогда  
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_ItogovyjOtchetONesootvetstvii.Soglasuyushchie");	
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Polzovatel");
		
		Если МассивУчастников.Количество() = 0 Тогда 
			// добавим служебного пользователя DORobot. Задача согласования по нему выполнится автоматически с помощью функционала эскалации
			СлужебныйПользователь = Справочники.Пользователи.НайтиПоНаименованию("DORobot");
			Если ЗначениеЗаполнено(СлужебныйПользователь) Тогда 
				МассивУчастников.Добавить(СлужебныйПользователь);
			КонецЕсли;
		КонецЕсли;
			
		Если МассивУчастников.Количество() = 0 Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция ПодписантыАктаИОтчетаЧ1(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_AktObUstraneniiNesootvetstviya")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast1")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast2")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast3")
			и ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ItogovyjOtchetONesootvetstvii") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Doc.Polzovatel КАК Polzovatel
		|ИЗ
		|	&Документ КАК Doc
		|ГДЕ
		|	Doc.Ссылка = &Ссылка
		|	И Doc.EtapPodpisaniya
		|	И Doc.Polzovatel <> &ПустойПользователь";
		
		Если ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_AktObUstraneniiNesootvetstviya") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_AktObUstraneniiNesootvetstviya.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast1") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast1.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast2") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast2.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_OtchetONesootvetstviiCHast3") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_OtchetONesootvetstviiCHast3.Soglasuyushchie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_ItogovyjOtchetONesootvetstvii") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_ItogovyjOtchetONesootvetstvii.Soglasuyushchie");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Polzovatel");
		
		Если МассивУчастников.Количество() = 0 Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция ИсполнитьВСДИКоррекция(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya")
			И ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_KorrektiruyushcheeDejstvie") 
			И ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_PreduprezhdayushcheeDejstvie") Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документ.Otvetstvennyj КАК Otvetstvennyj
		|ИЗ
		|	&Документ КАК Документ
		|ГДЕ
		|	Документ.Otvetstvennyj <> &ПустойПользователь
		|	И Документ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		
		Если ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_KorrektiruyushcheeDejstvie") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_KorrektiruyushcheeDejstvie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_PreduprezhdayushcheeDejstvie") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_PreduprezhdayushcheeDejstvie");
		КонецЕсли;
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Otvetstvennyj");
		
		Если МассивУчастников.Количество() = 0 Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции	

Функция ОзнакомитьсяВСДИКоррекция(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	Исполнитель = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya")
			И ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_KorrektiruyushcheeDejstvie")
			И ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_PreduprezhdayushcheeDejstvie") Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документ.Nesootvetstvie КАК Nesootvetstvie
		|ПОМЕСТИТЬ ВремТЗ
		|ИЗ
		|	&Документ КАК Документ
		|ГДЕ
		|	Документ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ra_KomandyNesootvetstvij.Otvetstvennyj КАК Otvetstvennyj
		|ИЗ
		|	РегистрСведений.ra_KomandyNesootvetstvij КАК ra_KomandyNesootvetstvij
		|ГДЕ
		|	ra_KomandyNesootvetstvij.Nesootvetstvie В
		|			(ВЫБРАТЬ
		|				ВремТЗ.Nesootvetstvie
		|			ИЗ
		|				ВремТЗ КАК ВремТЗ)
		|	И ra_KomandyNesootvetstvij.LiderNesootvetstviya";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		
		Если ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_KorrektiruyushcheeDejstvie") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_KorrektiruyushcheeDejstvie");
		ИначеЕсли ТипЗнч(СтрокаПредмета.Предмет) = Тип("ДокументСсылка.ra_PreduprezhdayushcheeDejstvie") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Документ", "Документ.ra_PreduprezhdayushcheeDejstvie");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		Иначе	
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Исполнитель = Выборка.Otvetstvennyj;
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Исполнитель;
	
КонецФункции

Функция ОтветственныйЗаКачествоСоСтороныЗаявителя(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	Участник = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ZayavkaNaOcenkuSootvetstviya") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_ZayavkaNaOcenkuSootvetstviya.OtvetstvennyjDopustivshij КАК OtvetstvennyjDopustivshij
		|ИЗ
		|	Документ.ra_ZayavkaNaOcenkuSootvetstviya КАК ra_ZayavkaNaOcenkuSootvetstviya
		|ГДЕ
		|	ra_ZayavkaNaOcenkuSootvetstviya.OtvetstvennyjDopustivshij <> &ПустойПользователь
		|	И ra_ZayavkaNaOcenkuSootvetstviya.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Участник = Выборка.OtvetstvennyjDopustivshij;
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(Участник) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав участников по причине остутствия их в документе ""%1"".'; en = 'Participants in the agreement in the document are not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция КомандаДляОзнакомленияСАннулированиемНС(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_Nesootvetstvie") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_KomandyNesootvetstvij.Otvetstvennyj КАК Polzovatel
		|ИЗ
		|	РегистрСведений.ra_KomandyNesootvetstvij КАК ra_KomandyNesootvetstvij
		|ГДЕ
		|	ra_KomandyNesootvetstvij.Nesootvetstvie = &Nesootvetstvie";
		
		Запрос.УстановитьПараметр("Nesootvetstvie", СтрокаПредмета.Предмет);
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Polzovatel");
		
		Если МассивУчастников.Количество() = 0 Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав команды для ""%1"".'; en = 'Nonconformity team for ""%1"" is empty'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

Функция ОзнакомлениеССигналом(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	Участник = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_Signal") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_Signal.OtvetstvenniyZaKachestvo КАК OtvetstvenniyZaKachestvo
		|ИЗ
		|	Документ.ra_Signal КАК ra_Signal
		|ГДЕ
		|	ra_Signal.Ссылка = &Ссылка
		|	И ra_Signal.OtvetstvenniyZaKachestvo <> &ПустойПользователь";
		
		Запрос.УстановитьПараметр("Ссылка", СтрокаПредмета.Предмет);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Участник = Выборка.OtvetstvenniyZaKachestvo;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Участник) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен ответственный за качество по причине остутствия их в документе ""%1"".'; en = 'Responsible for quality in the document is not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

#Область РолиКО

Функция РуководительКонтролераКО(БизнесПроцессОбъект, ИмяПредмета) Экспорт 
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета, "ИмяПредмета");
	
	Участник = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ZayavkaNaKontrolnuyuOperaciyu") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));	
		КонецЕсли;
			
		Участник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПредмета.Предмет, "RukovoditelKontrolera");
				
		Если Не ЗначениеЗаполнено(Участник) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен руководитель контролера в документе ""%1"".'; en = 'Controller manager is not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция КонтролерКО(БизнесПроцессОбъект, ИмяПредмета) Экспорт 
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета, "ИмяПредмета");
	
	Участник = Справочники.Пользователи.ПустаяСсылка();
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ZayavkaNaKontrolnuyuOperaciyu") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));	
		КонецЕсли;
			
		Участник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПредмета.Предмет, "Kontroler");
				
		Если Не ЗначениеЗаполнено(Участник) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен руководитель контролера в документе ""%1"".'; en = 'Controller manager is not filled out ""%1""'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат Участник;
	
КонецФункции

Функция УчастникиКО(БизнесПроцессОбъект, ИмяПредмета) Экспорт
	
	СтрокаПредмета = БизнесПроцессОбъект.Предметы.Найти(ИмяПредмета,"ИмяПредмета");
	
	МассивУчастников = Новый Массив;
	
	Если СтрокаПредмета <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(СтрокаПредмета.Предмет) Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как не указан предмет ""%1"" процесса.'; en = 'Auto-substitution cannot be executed because process subject ""%1"" is not specified.'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПредмета.Предмет) <> Тип("ДокументСсылка.ra_ZayavkaNaKontrolnuyuOperaciyu") Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Автоподстановка не может быть выполнена, так как указан предмет с типом, отличным от ""%1"".'; en = 'Auto-substitution cannot be executed because selected subject not ""%1"".'"),
				Строка(ИмяПредмета));
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ra_UchastnikiKontrolnyhOperaciy.Otvetstvennyj КАК Polzovatel
		|ИЗ
		|	РегистрСведений.ra_UchastnikiKontrolnyhOperaciy КАК ra_UchastnikiKontrolnyhOperaciy
		|ГДЕ
		|	ra_UchastnikiKontrolnyhOperaciy.ZayavkaNaKontrolnuyuOperaciyu = &ZayavkaNaKontrolnuyuOperaciyu";
		
		Запрос.УстановитьПараметр("ZayavkaNaKontrolnuyuOperaciyu", СтрокаПредмета.Предмет);
		
		МассивУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Polzovatel");
		
		Если МассивУчастников.Количество() = 0 Тогда 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен состав команды для ""%1"".'; en = 'Team for ""%1"" is empty'"),
				Строка(СтрокаПредмета.Предмет));
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не найден предмет ""%1"" процесса.'; en = 'Process subject ""%1"" not found.'"),
			Строка(ИмяПредмета));
		
	КонецЕсли;
	
	Возврат МассивУчастников;
	
КонецФункции

#КонецОбласти

// ТСК Корнюшенков А.Ю. Искать текст "МаршрутыСогласованияЕОСК" 29.06.2018 }

#КонецОбласти
