
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Проверка на заполненность поля ВидДокумента
	Если НЕ ЗначениеЗаполнено(ВладелецФайла) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Владелец файла"" не заполнено'; en = 'Field  ""File owner"" is not filled'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Объект.ВладелецФайла", ,Отказ);
	КонецЕсли;	
	// ТСК Талько Э.Г.; 16.07.2018; Печать {
	ПроверитьТермыНаУникальность(Отказ);
	// ТСК Талько Э.Г.; 16.07.2018; Печать }
	
КонецПроцедуры

// ТСК Талько Э.Г.; 16.07.2018; Печать {
Процедура ПроверитьТермыНаУникальность(Отказ)
	
	Кэш = Новый Массив;
	Для каждого Строка Из ДанныеДляАвтозаполнения Цикл
		Если ЗначениеЗаполнено(Строка.ВыражениеОбработкиРезультатаЗамены)
			И СтрНайти(Строка.ВыражениеОбработкиРезультатаЗамены, "ра_СлужебныйПараметрДляТЗ") > 0 Тогда
			МассивКолонок = ра_ОбщегоНазначения.ПолучитьМассивКолонокТаблицыИзВыраженияСкрипта(Строка.ВыражениеОбработкиРезультатаЗамены, "СозданиеШаблона");
			
			Для Каждого Колонка ИЗ МассивКолонок Цикл
				Если Кэш.Найти(СокрЛП(Колонка.Имя)) <> Неопределено Тогда
					ТекстСообщения = НСтр("ru = 'Повторяющийся терм для замены ""%1""'; en = 'Repeating term for replacement ""%1""'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, СокрЛП(Колонка.Имя)), ЭтотОбъект,,, Отказ);
				Иначе
					Кэш.Добавить(СокрЛП(Колонка.Имя));
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(Строка.ТермДляЗамены) Тогда
			Если Кэш.Найти(СокрЛП(Строка.ТермДляЗамены)) <> Неопределено Тогда
				ТекстСообщения = НСтр("ru = 'Повторяющийся терм для замены ""%1""'; en = 'Repeating term for replacement ""%1""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, СокрЛП(Строка.ТермДляЗамены)), ЭтотОбъект,,, Отказ);
			Иначе
				Кэш.Добавить(СокрЛП(Строка.ТермДляЗамены));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// ТСК Талько Э.Г.; 16.07.2018; Печать }
