
&НаКлиенте
Процедура Заполнить(Команда)
	
	Состояние(НСтр("ru = 'Идет заполнение сведений о подчиненности пользователей! Пожалуйста подождите...'; en = 'Go filling information about subordination employees! Please wait ...'"));
	УправлениеДоступомВызовСервераДокументооборот.ЗаполнитьПодчиненностьПользователей();
	Состояние(НСтр("ru = 'Сведения о подчиненности пользователей заполнены!'; en = 'Information about subordination employees filled!'"));
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


