
#Область СобытияИКомандыФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\";
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	ПотокСтрок = ПолучитьПотокЧтенияСтрок();
	
	Если ПутьКФайлу = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан файл для загрузки";
		Сообщение.Поле = "Объект.ИмяФайла";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
	ЗагрузитьНаСервере(ПотокСтрок);		
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСвязи(Команда)
	
	ПотокСтрок = ПолучитьПотокЧтенияСтрок();
	
	Если ПутьКФайлу = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан файл для загрузки";
		Сообщение.Поле = "Объект.ИмяФайла";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
		
	ЗаполнитьСвязи(ПотокСтрок);		
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	КомандаУдалитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере(ПотокСтрок)
	
	Таб = ЧтениеТХТФайла(ПотокСтрок, 4);
	
	//обработка таблицы значений 
	//
	Для Каждого Строка Из Таб Цикл
		
		Если Строка.Колонка1 = "Проектная позиция" Тогда
			ИмяСправочника = "ra_Oborudovanie";
		ИначеЕсли Строка.Колонка1 = "Система" Тогда			
			ИмяСправочника = "ra_TekhnologicheskieSistemy";
		ИначеЕсли Строка.Колонка1 = "Здание" Тогда			
			ИмяСправочника = "ra_ZdaniyaSooruzheniya";
		КонецЕсли;	
		
		СпрСсылка = Справочники[ИмяСправочника].НайтиПоРеквизиту("ID", Строка.Колонка2);
		Если СпрСсылка.Пустая() Тогда
			СпрОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
		Иначе
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		СпрОбъект.ID = Строка.Колонка2;
		СпрОбъект.Владелец = Проект;
		СпрОбъект.KKS = Строка.Колонка3;
		СпрОбъект.Opisanie = Строка.Колонка4;
		СпрОбъект.Записать();
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязи(ПотокСтрок)
	
	Таб = ЧтениеТХТФайла(ПотокСтрок, 5);

	//обработка таблицы значений 
	//
	Для Каждого Строка Из Таб Цикл
		
		ОборудованиеСсылка = Справочники.ra_Oborudovanie.НайтиПоРеквизиту("ID", Строка.Колонка5);
		Если ЗначениеЗаполнено(ОборудованиеСсылка) Тогда
			
			СпрОбъект = ОборудованиеСсылка.ПолучитьОбъект();
			
			Если Строка.Колонка1 = "Система-оборудование" Тогда						
				ПодставляемаяСсылка = Справочники.ra_TekhnologicheskieSistemy.НайтиПоРеквизиту("ID", Строка.Колонка4);
				СпрОбъект.TekhnologicheskayaSistema = ПодставляемаяСсылка;
			ИначеЕсли Строка.Колонка1 = "Здание-оборудование" Тогда						
				ПодставляемаяСсылка = Справочники.ra_ZdaniyaSooruzheniya.НайтиПоРеквизиту("ID", Строка.Колонка4);			
				СпрОбъект.ZdaniyaSooruzheniya = ПодставляемаяСсылка;			
			КонецЕсли;		
			
			СпрОбъект.Записать();
			
		Иначе
			
			Сообщить(Строка.Колонка5);
			
		КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура КомандаУдалитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ra_ZdaniyaSooruzheniya.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ra_ZdaniyaSooruzheniya КАК ra_ZdaniyaSooruzheniya
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ra_TekhnologicheskieSistemy.Ссылка
	|ИЗ
	|	Справочник.ra_TekhnologicheskieSistemy КАК ra_TekhnologicheskieSistemy
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ra_Oborudovanie.Ссылка
	|ИЗ
	|	Справочник.ra_Oborudovanie КАК ra_Oborudovanie";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОб = Выборка.Ссылка.ПолучитьОбъект();
		СпрОб.Удалить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПотокЧтенияСтрок()
	
	Попытка
		// Используется для доступа к параметрам файлов или каталогов. 
		ТекстовыйФайл = Новый Файл(ПутьКФайлу);
		Если ТекстовыйФайл.Существует() = Ложь Тогда
			Сообщить("Файла " + ПутьКФайлу + " не существует!");
			Возврат Неопределено;
		КонецЕсли;
		
		// Текстовый документ предназначен для работы с текстами. 
		// Объект позволяет получать и сохранять текст в файле, 
		// работать со строками
		ПотокЧтенияСтрок = Новый ТекстовыйДокумент();
		ПотокЧтенияСтрок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщить("Файл не прочитан.", СтатусСообщения.Внимание);
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	//ХранилищеЗначения =  Новый ХранилищеЗначения(ПотокЧтенияСтрок, Новый СжатиеДанных(9));
	// Возвращает текст, извлеченный из файла
	Возврат ПотокЧтенияСтрок;
	
КонецФункции // ПолучитьПотокЧтенияСтрок

&НаСервере
Функция ЧтениеТХТФайла(ПотокСтрок, МаксимальноеКоличествоКолонок)
		
	// Открыть файл, создать текстовый документ, прочитать
	//ПотокСтрок = ХранилищеЗначения.Получить();
		
	ТаблицаДокумента = Новый ТаблицаЗначений;
	ТаблицаДокумента.Колонки.Добавить("Колонка1");
	ТаблицаДокумента.Колонки.Добавить("Колонка2");
	ТаблицаДокумента.Колонки.Добавить("Колонка3");
	ТаблицаДокумента.Колонки.Добавить("Колонка4");
	ТаблицаДокумента.Колонки.Добавить("Колонка5");
	
	// Последовательное чтение строк текстового файла
	КоличествоСтрок = ПотокСтрок.КоличествоСтрок();
	Для Строка = 2 По КоличествоСтрок Цикл
				
		// Чтение строки из файла тхт / csv
		СтрокаИзФайла = ПотокСтрок.ПолучитьСтроку(Строка);
		
		// Разбор строки в массив, используя в качествен символа-разделителя ";"
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаИзФайла,";");
		
		// Добавить данные в табличную часть экранной формы
		Стр = ТаблицаДокумента.Добавить();
		
		КолвоЭл = МассивСтрок.Количество();
		Сч = 0;
		СчКолонок = 1;
		Для Каждого Эл Из МассивСтрок Цикл
			Если СчКолонок > МаксимальноеКоличествоКолонок Тогда
				Стр["Колонка" + Строка(МаксимальноеКоличествоКолонок)] = Стр["Колонка" + Строка(МаксимальноеКоличествоКолонок)] + ";" + МассивСтрок[Сч];
			Иначе			
				Стр["Колонка" + Строка(СчКолонок)] = МассивСтрок[Сч];
				СчКолонок = СчКолонок + 1;
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

#КонецОбласти


