
// Возвращает свойства предопределенных метрик ЧастотаЗамеров и Описание
// 
Функция СвойстваПредопределенныхМетрик() Экспорт
	
	// Заполнение настроек метрик
	СвойстваМетрик = Новый Соответствие;
	СвойстваМетрик.Вставить(Справочники.Метрики.ДолгаяОчередь, 
		Новый Структура("ЧастотаЗамеров, Описание", 10,
			НСтр("ru = 'Количество записей в долгой очереди обновления прав доступа'; en = 'Permissions update queue size (long)'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.ОперативнаяОчередь, 
		Новый Структура("ЧастотаЗамеров, Описание", 10,
			НСтр("ru = 'Количество записей в оперативной очереди обновления прав доступа'; en = 'Permissions update queue size (operational)'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивныеПользователи, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество одновременно работающих пользователей программы'; en = 'Concurrent users number'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивностьПользователей, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество записей в протоколе работы пользователей за последние сутки'; en = 'User activity log size in the last 24 hours'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.АктивныеПроцессы, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество активных процессов'; en = 'Active processes number'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.НевыполненныеЗадачи, 
		Новый Структура("ЧастотаЗамеров, Описание", 60,
			НСтр("ru = 'Количество невыполненных задач'; en = 'Failed tasks number'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.РазмерФайлов, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Суммарный размер всех файлов'; en = 'Total size of all files'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.Файлы, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество файлов'; en = 'Files number'")));
	
	СвойстваМетрик.Вставить(Справочники.Метрики.Контрагенты, 
		Новый Структура("ЧастотаЗамеров, Описание", 1440,
			НСтр("ru = 'Количество контрагентов'; en = 'Number of counterparties'")));
	
	Возврат СвойстваМетрик;
	
КонецФункции


