#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РезультатСогласования") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"РезультатСогласования",
			НСтр("ru = 'Результат согласования'; en = 'Result of coordination'"),
			СформироватьПечатнуюФормуЛистаСогласования(МассивОбъектов,ОбъектыПечати));
		
	КонецЕсли;
		
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуЛистаСогласования(МассивОбъектов,ОбъектыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЛИСТ_СОГЛАСОВАНИЯ";
	
	НомерТипаДокумента = 0;
	
	Макет = Обработки.ра_ПечатьОбщихФорм.ПолучитьМакет("ПФ_MXL_ЛистСогласования");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	// ТСК Близнюк С.И.; 12.10.2018; task#1451{
	ДокументСсылка = МассивОбъектов[0];
	СинонимДокумента = ДокументСсылка.Метаданные().Синоним;
	// ТСК Близнюк С.И.; 17.12.2018; task#2010}
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ra_ZayavkaNaKontrolnuyuOperaciyu") Тогда
		РезультатКО  = Документы.ra_RezultatKontrolnoyOperacii.ПоследнийРезультатКО(ДокументСсылка, Ложь).Ссылка;
		СтруктураДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РезультатКО, "Номер,Дата");
		
		СинонимДокумента = РезультатКО.Метаданные().Синоним;
		
		Заголовок = "Лист визирования %1 № %2 от %3 
					|Является неотъемлемой частью документа.";
		Заголовок = СтрШаблон(Заголовок, СинонимДокумента, СтруктураДокумента.Номер, Формат(СтруктураДокумента.Дата,"ДФ=dd.MM.yyyy"));
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ra_RezultatKontrolnoyOperacii") Тогда
		СтруктураДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Номер,Дата,ZayavkaNaKontrolnuyuOperaciyu");
		
		Заголовок = "Лист визирования %1 № %2 от %3 
					|Является неотъемлемой частью документа.";
		Заголовок = СтрШаблон(Заголовок, СинонимДокумента, СтруктураДокумента.Номер, Формат(СтруктураДокумента.Дата,"ДФ=dd.MM.yyyy"));
		
		//// временно
		//МассивОбъектов.Очистить();
		//МассивОбъектов.Добавить(СтруктураДокумента.ZayavkaNaKontrolnuyuOperaciyu);
  	Иначе
	// ТСК Близнюк С.И.; 17.12.2018; task#2010}
		СтруктураДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Номер,Дата,Nesootvetstvie.Номер");
		
		Заголовок = "Лист визирования %1 № %2 от %3 Несоответствие %4
					|Является неотъемлемой частью документа.";
		Заголовок = СтрШаблон(Заголовок, СинонимДокумента, СтруктураДокумента.Номер, Формат(СтруктураДокумента.Дата,"ДФ=dd.MM.yyyy"), СтруктураДокумента.NesootvetstvieНомер);
	КонецЕсли;	
	ОбластьЗаголовок.Параметры.Заполнить(Новый Структура("Заголовок", Заголовок));
	// ТСК Близнюк С.И.; 12.10.2018; task#1451}
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТаблицаДанных = ра_РаботаСПроцессами.ПолучитьЭтапыСогласованияПоДокументу(МассивОбъектов[0]);
	
	Для каждого ТекСтрока Из ТаблицаДанных.НайтиСтроки(Новый Структура("Исполнитель", "DORobot")) Цикл // артефакт
		ТаблицаДанных.Удалить(ТекСтрока);
	КонецЦикла;
		
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл 
		ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
			
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
