
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектБД = РеквизитФормыВЗначение("Объект");
	АдресФайла = ПоместитьВоВременноеХранилище(ОбъектБД.WSDL.Получить(), УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда  
		ТекущийОбъект.WSDL = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьWSDL(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьWSDLЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,,Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗагрузитьWSDLЗавершение(Результат, Адрес, ИмяФайла, ДополнительныеПараметры) Экспорт  
	
	Если Результат Тогда 
		АдресФайла = Адрес;
	КонецЕсли;	
	
	СтруктураВозврата = ПолучитьURI_ИмяСервисаИзWSDL(ИмяФайла);
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(Объект, СтруктураВозврата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьWSDL(Команда)
	
	АдресФайлаВоВременномХранилище = "";
	ВыгрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище);
	
	ПолучитьФайл(АдресФайлаВоВременномХранилище,Объект.ИмяСервиса + ".wsdl");

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьДанныеНаСервере(Адрес)

	об = РеквизитФормыВЗначение("Объект");
	
	Адрес = ПоместитьВоВременноеХранилище(об.WSDL.Получить());
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьURI_ИмяСервисаИзWSDL(ИмяФайла) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	СтруктураВозврата = Новый Структура("URI, ИмяСервиса", "", "");
	
	Попытка
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если (ЧтениеXML.Имя = "wsdl:definitions" ИЛИ ЧтениеXML.Имя = "definitions") 
				И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
								
				Для сч = 0 По ЧтениеXML.КоличествоАтрибутов() Цикл
					Если ЧтениеXML.ИмяАтрибута(сч) = "targetNamespace" Тогда 
						СтруктураВозврата.URI = ЧтениеXML.ЗначениеАтрибута(сч);       
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				
			ИначеЕсли (ЧтениеXML.Имя = "wsdl:service" ИЛИ ЧтениеXML.Имя = "service") 
				И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				Для сч = 0 По ЧтениеXML.КоличествоАтрибутов() Цикл
					Если ЧтениеXML.ИмяАтрибута(сч) = "name" Тогда 
						СтруктураВозврата.ИмяСервиса = ЧтениеXML.ЗначениеАтрибута(0);         
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Исключение
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции
	
#КонецОбласти




