
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(ра_РаботаСПечатнымиФормами.ПолучитьДеревоШаблонов(), "ДеревоСкриптов");
	
	ТекстСкрипта = Параметры.Текст;
	Если ПустаяСтрока(ТекстСкрипта) Тогда
		ТекстСкрипта = "РезультатОбработки = ";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСкриптовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоСкриптов.ТекущиеДанные;
	Если Не ПустаяСтрока(ТекущиеДанные.ТекстСкрипта) Тогда
		ТекстСкрипта = "РезультатОбработки = " + ТекущиеДанные.ТекстСкрипта + " // " + ТекущиеДанные.ИмяСкрипта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Для Сч = 1 по СтрЧислоСтрок(ТекстСкрипта) Цикл
		
		ТекстСтроки         = СтрПолучитьСтроку(ТекстСкрипта, Сч);
		ПозицияИмениТаблицы = СтрНайти(ТекстСкрипта, "<Имя таблицы>");
		ПозицияКомментария  = СтрНайти(ТекстСкрипта, "//");
		
		Если ПозицияИмениТаблицы и (ПозицияИмениТаблицы < ПозицияКомментария или ПозицияКомментария = 0) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указано имя таблицы вместо параметра <Имя таблицы>'; en = 'Parameter not filled <Имя таблицы>'"),,"ТекстСкрипта");	
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Закрыть(ТекстСкрипта);
	
КонецПроцедуры
