
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("НеОтбирать") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ra_DostupnostFormOS.FormaOS КАК FormaOS,
		|	ПРЕДСТАВЛЕНИЕ(ra_DostupnostFormOS.FormaOS) КАК Представление
		|ИЗ
		|	РегистрСведений.ra_DostupnostFormOS КАК ra_DostupnostFormOS
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ra_DostupnostFormOS.Ispolnitel = Пользователи.ра_Организация
		|			И (Пользователи.Ссылка = &Пользователь)";
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.FormaOS, Выборка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

