
#Область ОбработчикиСобытийФормы

// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 10.10.2018 {
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПоляЗначениямиКонстант();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаСправочникаWSСсылки(Команда)
	ОткрытьФорму("Справочник.ра_WSСсылки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	ЗаписатьКонстантура_ДанныеДляВходаВЕОС();	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ЗаписатьКонстантура_ДанныеДляВходаВЕОС();	
КонецПроцедуры

&НаКлиенте
Процедура ра_КодСистемы1СДляЕОСПриИзменении(Элемент)
	ЗаписатьОбъект();	
КонецПроцедуры

&НаКлиенте
Процедура ра_ИнтернетАдресЕОСКПриИзменении(Элемент)
	ЗаписатьОбъект();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеСистемыМониторингаИКонтроляПриИзменении(Элемент)
	ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ();	
КонецПроцедуры

&НаКлиенте
Процедура КритичностьПриИзменении(Элемент)
	ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ();		
КонецПроцедуры

&НаКлиенте
Процедура РабочаяГруппаПриИзменении(Элемент)
	ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ();	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ();	
КонецПроцедуры

&НаКлиенте
 Процедура ПолучательПисьмаПриИзменении(Элемент)
	ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ(); 
КонецПроцедуры

&НаКлиенте
 Процедура ОтправительПисьмаВСУИТПриИзменении(Элемент)
	 ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ();
 КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОбъект() 
	
	Набор = РеквизитФормыВЗначение("НаборКонстант");
	Набор.Записать();

	ЗначениеВРеквизитФормы(Набор, "НаборКонстант");

	Модифицированность = Ложь;

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры	

Процедура ЗаписатьКонстантура_ДанныеДляВходаВЕОС()
	Константы.ра_ДанныеДляВходаВЕОС.Установить(Новый ХранилищеЗначения(Новый Структура("ЛогинВЕОС, ПарольВЕОС", Логин, Пароль)));
КонецПроцедуры 	

Процедура ЗаписатьКонстантура_ра_ПараметрыИнтеграцииССУИТ()
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НаименованиеСистемыМониторингаИКонтроля", НаименованиеСистемыМониторингаИКонтроля);
	СтруктураДанных.Вставить("Критичность",   Критичность);
	СтруктураДанных.Вставить("Услуга", 		  Услуга);
	СтруктураДанных.Вставить("РабочаяГруппа", РабочаяГруппа);
	СтруктураДанных.Вставить("ПолучательПисьма", ПолучательПисьма);
	СтруктураДанных.Вставить("ОтправительПисьма", ОтправительПисьмаВСУИТ);
	Константы.ра_ПараметрыИнтеграцииССУИТ.Установить(Новый ХранилищеЗначения(СтруктураДанных));	
КонецПроцедуры

Процедура ЗаполнитьПоляЗначениямиКонстант()
	Данные = Константы.ра_ДанныеДляВходаВЕОС.Получить().Получить();
	Если ТипЗнч(Данные) = Тип("Структура") Тогда 
		Логин = Данные.ЛогинВЕОС;
		Пароль = Данные.ПарольВЕОС;
	КонецЕсли;	
		
	Данные = Константы.ра_ПараметрыИнтеграцииССУИТ.Получить().Получить();
	Если ТипЗнч(Данные) = Тип("Структура") Тогда 
		НаименованиеСистемыМониторингаИКонтроля = Данные.НаименованиеСистемыМониторингаИКонтроля;
		Критичность   = Данные.Критичность;
		Услуга		  = Данные.Услуга;
		РабочаяГруппа = Данные.РабочаяГруппа;
		ПолучательПисьма = Данные.ПолучательПисьма;
		Если Данные.Свойство("ОтправительПисьма") Тогда 
			ОтправительПисьмаВСУИТ = Данные.ОтправительПисьма;
		КонецЕсли;	
	КонецЕсли;	
		
 КонецПроцедуры	


// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 10.10.2018 } 

#КонецОбласти