

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьТаблицуИспользования();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьТаблицуИспользования();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Primenenie.Очистить();
	Для Каждого СтрокаТЗ Из ТаблицаПрименения Цикл
		Если СтрокаТЗ.Использование Тогда
			СтрокаТЧ = ТекущийОбъект.Primenenie.Добавить();
			СтрокаТЧ.EhtapVyyavleniya = СтрокаТЗ.Этап;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуИспользования()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка КАК Этап,
	|	ВЫБОР
	|		КОГДА ra_KontrolnyeMeropriyatiyaPrimenenie.EhtapVyyavleniya ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование
	|ИЗ
	|	Справочник.ra_EhtapyVyyavleniyaNesootvetstvij КАК ra_EhtapyVyyavleniyaNesootvetstvij
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ra_KontrolnyeMeropriyatiya.Primenenie КАК ra_KontrolnyeMeropriyatiyaPrimenenie
	|		ПО ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка = ra_KontrolnyeMeropriyatiyaPrimenenie.EhtapVyyavleniya
	|			И ra_KontrolnyeMeropriyatiyaPrimenenie.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ ra_EhtapyVyyavleniyaNesootvetstvij.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаПрименения.Загрузить(Запрос.Выполнить().Выгрузить());
				
КонецПроцедуры

#КонецОбласти