
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуИспользования();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаПримененияПриАктивизацииСтроки(Элемент)
	
	EhtapVyyavleniyaNesootvetstvija = Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("EhtapVyyavleniyaNesootvetstvija"));
	
	ТекущиеДанные = Элементы.ТаблицаПрименения.ТекущиеДанные;
				
	EhtapVyyavleniyaNesootvetstvija.Использование = ЗначениеЗаполнено(ТекущиеДанные.Этап);
	EhtapVyyavleniyaNesootvetstvija.Значение = ТекущиеДанные.Этап;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуИспользования()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ra_EhtapyVyyavleniyaNesootvetstvij.Ссылка КАК Этап
	|ИЗ
	|	Справочник.ra_EhtapyVyyavleniyaNesootvetstvij КАК ra_EhtapyVyyavleniyaNesootvetstvij
	|ГДЕ
	|	НЕ ra_EhtapyVyyavleniyaNesootvetstvij.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ra_EhtapyVyyavleniyaNesootvetstvij.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап
	|АВТОУПОРЯДОЧИВАНИЕ");
		
	ТаблицаПрименения.Загрузить(Запрос.Выполнить().Выгрузить());
				
КонецПроцедуры

#КонецОбласти