#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	// ТСК Ткаченко И.Л.; 15.08.2018; task#985{
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	// ТСК Ткаченко И.Л.; 15.08.2018; task#985}
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	// ТСК Ткаченко И.Л.; 15.08.2018; task#985{
	СтандартнаяОбработка = Ложь;

	Представление = ?(Данные.Код = Null, "", Данные.Код) + " " + ?(Данные.Наименование = Null, "", Данные.Наименование);
	// ТСК Ткаченко И.Л.; 15.08.2018; task#985}
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
