
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("НеОтбирать") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ra_SkhemySertifikacii.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(ra_SkhemySertifikacii.Ссылка) КАК Представление
		|ИЗ
		|	Перечисление.ra_SkhemySertifikacii КАК ra_SkhemySertifikacii
		|%1";
		
		ФормаОС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "FormaOS");
		Если ФормаОС <> Неопределено Тогда
			Если ФормаОС = Перечисления.ra_FormyOcenkiSootvetstviya.PoryadokObyazatelnojSertifikacii Тогда
				ТекстЗапросаУсловие = 
				"ГДЕ
				|	ra_SkhemySertifikacii.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ra_SkhemySertifikacii.NePrimenyaetsya)";
			Иначе
				ТекстЗапросаУсловие = 
				"ГДЕ
				|	ra_SkhemySertifikacii.Ссылка = ЗНАЧЕНИЕ(Перечисление.ra_SkhemySertifikacii.NePrimenyaetsya)";
			КонецЕсли;
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ТекстЗапросаУсловие);
		Иначе
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "");
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);				
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
