
&НаКлиенте
Процедура ПриОткрытии(Отказ, СтандартнаяОбработка)
	
	ВывестиПериодВСутках();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗамеровПриИзменении(Элемент)
	
	ВывестиПериодВСутках();
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПериодВСутках()
	
	Текст = НСтр("ru = 'минут'; en = 'minutes'");
	
	Если Объект.ПериодЗамеров >= 600 Тогда
		КолСуток = Окр(Объект.ПериодЗамеров / 1440, 2);
		Текст = Текст + " (" + "" + КолСуток + " " + 
			?(КолСуток = 1, НСтр("ru = 'сутки'; en = 'day'"), НСтр("ru = 'суток'; en = 'days'")) + ")";
	КонецЕсли;
	
	Элементы.ПериодЗамеровЕдИзм.Заголовок = Текст;
	
КонецПроцедуры


