
Функция ContractSend(PurchasingContractSRMReplicationRequest)
		
	ВидИнтеграции = Перечисления.ра_ВидыИнтеграций.SRM_Purchases;
	СообщениеОбУспехе = "Договор успешно загружен";
	
	Попытка
		Если Константы.ра_ИспользоватьВнешнююОбработкуИнтеграции.Получить() Тогда
			//внешняя обработка
			во = ВнешниеОбработки.Создать(Константы.ра_ПутьКОбработкеВебСервисовИнтеграции.Получить(), Ложь);
			Статус = во.ВыполнитьСценарийЗагрузкиЗапросаПредложения(PurchasingContractSRMReplicationRequest, "");
		Иначе
			Статус = Обработки.ра_Интеграция.ВыполнитьСценарийЗагрузкиЗапросаПредложения(PurchasingContractSRMReplicationRequest, "");
		КонецЕсли;
		
		Возврат Статус;
	Исключение
		Обработки.ра_Интеграция.ДобавитьЗаписьВЖурналОбмена(PurchasingContractSRMReplicationRequest,ФабрикаXDTO,ВидИнтеграции, ОписаниеОшибки(),, Истина, Ложь, Истина);
		Возврат "IN_WARN"+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
КонецФункции



