
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373{
	//Если ОценкаПроизводительностиВызовСервераПовтИсп.ВыполнятьЗамерыПроизводительности() Тогда
	//	ВремяНачала = ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени();
	//	ДополнительныеСвойства.Вставить("ВремяНачала", ВремяНачала);	
	//КонецЕсли;
	//// ТСК Близнюк С.И.; 09.10.2018; task#1373}
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ра_ОбщегоНазначения.ДокументыКачестваПередЗаписью(ЭтотОбъект);
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьРезультат();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьРезультат()
	
	МЗ_Результат = РегистрыСведений.ra_RezultatyDejstvijPoZayavkeNaOS.СоздатьМенеджерЗаписи();
	МЗ_Результат.Zayavka  = ДокументОснование;
	МЗ_Результат.Dejstvie = Ссылка;
	МЗ_Результат.Rezultat = Tekst;
	МЗ_Результат.Период   = ТекущаяДатаСеанса();
	МЗ_Результат.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
